{
    "id": "c0b20be1dcfca14eced0ac7b83f7c462",
    "metadata": {
        "id": "c0b20be1dcfca14eced0ac7b83f7c462",
        "url": "https://huggingface.co/meta-llama/Llama-2-70b-hf/",
        "title": "meta-llama/Llama-2-70b-hf · Hugging Face",
        "properties": {
            "description": "We’re on a journey to advance and democratize artificial intelligence through open source and open science.",
            "keywords": null,
            "author": null,
            "og:title": "meta-llama/Llama-2-70b-hf · Hugging Face",
            "og:type": "website",
            "og:url": "https://huggingface.co/meta-llama/Llama-2-70b-hf",
            "og:image": "https://cdn-thumbnails.huggingface.co/social-thumbnails/models/meta-llama/Llama-2-70b-hf.png",
            "twitter:card": "summary_large_image",
            "twitter:site": "@huggingface",
            "twitter:image": "https://cdn-thumbnails.huggingface.co/social-thumbnails/models/meta-llama/Llama-2-70b-hf.png"
        }
    },
    "parent_metadata": {
        "id": "acb536f0f9be308e21b5cbb69f9155da",
        "url": "https://www.notion.so/LLM-Inference-Optimization-Other-Techniques-acb536f0f9be308e21b5cbb69f9155da",
        "title": "LLM Inference Optimization & Other Techniques",
        "properties": {
            "Type": "Leaf"
        }
    },
    "content": "[![Hugging Face's logo](/front/assets/huggingface_logo-noborder.svg) Hugging Face](/)\n\n  * [ Models](/models)\n  * [ Datasets](/datasets)\n  * [ Spaces](/spaces)\n  * [ Posts](/posts)\n  * [ Docs](/docs)\n  * [ Enterprise](/enterprise)\n  * [Pricing](/pricing)\n  * [Log In](/login)\n  * [Sign Up](/join)\n\n\n\n# \n\n[![](https://cdn-avatars.huggingface.co/v1/production/uploads/646cf8084eefb026fb8fd8bc/oCTqufkdTkjyGodsx1vo1.png)](/meta-llama)\n\n[meta-llama](/meta-llama)\n\n/\n\n[Llama-2-70b-hf](/meta-llama/Llama-2-70b-hf)\n\nlike 843\n\nFollow\n\n![](https://cdn-avatars.huggingface.co/v1/production/uploads/646cf8084eefb026fb8fd8bc/oCTqufkdTkjyGodsx1vo1.png) Meta Llama 20.6k\n\n[ Text Generation ](/models?pipeline_tag=text-generation)[ Transformers ](/models?library=transformers)[ PyTorch ](/models?library=pytorch)[ Safetensors ](/models?library=safetensors)[ English ](/models?language=en)[ llama ](/models?other=llama)[ facebook ](/models?other=facebook)[ meta ](/models?other=meta)[ llama-2 ](/models?other=llama-2)[ text-generation-inference ](/models?other=text-generation-inference)[ Inference Endpoints ](/models?other=endpoints_compatible)\n\narxiv: 2307.09288\n\nLicense: llama2\n\n[ Model card ](/meta-llama/Llama-2-70b-hf)[ Files Files and versions ](/meta-llama/Llama-2-70b-hf/tree/main)\n\nTrain \n\nDeploy \n\nUse this model \n\n##  You need to share contact information with Meta to access this model\n\nThe information you provide will be collected, stored, processed and shared in accordance with the [Meta Privacy Policy](https://www.facebook.com/privacy/policy/).\n\n### LLAMA 2 COMMUNITY LICENSE AGREEMENT\n\n\"Agreement\" means the terms and conditions for use, reproduction, distribution and modification of the Llama Materials set forth herein.\"Documentation\" means the specifications, manuals and documentation accompanying Llama 2 distributed by Meta at <https://ai.meta.com/resources/models-and-libraries/llama-downloads/>.\"Licensee\" or \"you\" means you, or your employer or any other person or entity (if you are entering into this Agreement on such person or entity's behalf), of the age required under applicable laws, rules or regulations to provide legal consent and that has legal authority to bind your employer or such other person or entity if you are entering in this Agreement on their behalf.\"Llama 2\" means the foundational large language models and software and algorithms, including machine-learning model code, trained model weights, inference-enabling code, training-enabling code, fine-tuning enabling code and other elements of the foregoing distributed by Meta at ai.meta.com/resources/models-and-libraries/llama-downloads/.\"Llama Materials\" means, collectively, Meta's proprietary Llama 2 and documentation (and any portion thereof) made available under this Agreement.\"Meta\" or \"we\" means Meta Platforms Ireland Limited (if you are located in or, if you are an entity, your principal place of business is in the EEA or Switzerland) and Meta Platforms, Inc. (if you are located outside of the EEA or Switzerland). \n\nBy clicking \"I Accept\" below or by using or distributing any portion or element of the Llama Materials, you agree to be bound by this Agreement.\n\n  1. License Rights and Redistribution.a. Grant of Rights. You are granted a non-exclusive, worldwide, non- transferable and royalty-free limited license under Meta's intellectual property or other rights owned by Meta embodied in the Llama Materials to use, reproduce, distribute, copy, create derivative works of, and make modifications to the Llama Materials.b. Redistribution and Use.i. If you distribute or make the Llama Materials, or any derivative works thereof, available to a third party, you shall provide a copy of this Agreement to such third party.ii. If you receive Llama Materials, or any derivative works thereof, from a Licensee as part of an integrated end user product, then Section 2 of this Agreement will not apply to you.iii. You must retain in all copies of the Llama Materials that you distribute the following attribution notice within a \"Notice\" text file distributed as a part of such copies: \"Llama 2 is licensed under the LLAMA 2 Community License, Copyright (c) Meta Platforms, Inc. All Rights Reserved.\"iv. Your use of the Llama Materials must comply with applicable laws and regulations (including trade compliance laws and regulations) and adhere to the Acceptable Use Policy for the Llama Materials (available at <https://ai.meta.com/llama/use-policy>), which is hereby incorporated by reference into this Agreement.v. You will not use the Llama Materials or any output or results of the Llama Materials to improve any other large language model (excluding Llama 2 or derivative works thereof). \n\n  2. Additional Commercial Terms. If, on the Llama 2 version release date, the monthly active users of the products or services made available by or for Licensee, or Licensee's affiliates, is greater than 700 million monthly active users in the preceding calendar month, you must request a license from Meta, which Meta may grant to you in its sole discretion, and you are not authorized to exercise any of the rights under this Agreement unless or until Meta otherwise expressly grants you such rights.\n\n  3. Disclaimer of Warranty. UNLESS REQUIRED BY APPLICABLE LAW, THE LLAMA MATERIALS AND ANY OUTPUT AND RESULTS THEREFROM ARE PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. YOU ARE SOLELY RESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF USING OR REDISTRIBUTING THE LLAMA MATERIALS AND ASSUME ANY RISKS ASSOCIATED WITH YOUR USE OF THE LLAMA MATERIALS AND ANY OUTPUT AND RESULTS.\n\n  4. Limitation of Liability. IN NO EVENT WILL META OR ITS AFFILIATES BE LIABLE UNDER ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, TORT, NEGLIGENCE, PRODUCTS LIABILITY, OR OTHERWISE, ARISING OUT OF THIS AGREEMENT, FOR ANY LOST PROFITS OR ANY INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL, EXEMPLARY OR PUNITIVE DAMAGES, EVEN IF META OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF ANY OF THE FOREGOING.\n\n  5. Intellectual Property.a. No trademark licenses are granted under this Agreement, and in connection with the Llama Materials, neither Meta nor Licensee may use any name or mark owned by or associated with the other or any of its affiliates, except as required for reasonable and customary use in describing and redistributing the Llama Materials.b. Subject to Meta's ownership of Llama Materials and derivatives made by or for Meta, with respect to any derivative works and modifications of the Llama Materials that are made by you, as between you and Meta, you are and will be the owner of such derivative works and modifications.c. If you institute litigation or other proceedings against Meta or any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Llama Materials or Llama 2 outputs or results, or any portion of any of the foregoing, constitutes infringement of intellectual property or other rights owned or licensable by you, then any licenses granted to you under this Agreement shall terminate as of the date such litigation or claim is filed or instituted. You will indemnify and hold harmless Meta from and against any claim by any third party arising out of or related to your use or distribution of the Llama Materials.\n\n  6. Term and Termination. The term of this Agreement will commence upon your acceptance of this Agreement or access to the Llama Materials and will continue in full force and effect until terminated in accordance with the terms and conditions herein. Meta may terminate this Agreement if you are in breach of any term or condition of this Agreement. Upon termination of this Agreement, you shall delete and cease use of the Llama Materials. Sections 3, 4 and 7 shall survive the termination of this Agreement. \n\n  7. Governing Law and Jurisdiction. This Agreement will be governed and construed under the laws of the State of California without regard to choice of law principles, and the UN Convention on Contracts for the International Sale of Goods does not apply to this Agreement. The courts of California shall have exclusive jurisdiction of any dispute arising out of this Agreement.\n\n\n\n\n### Llama 2 Acceptable Use Policy\n\nMeta is committed to promoting safe and fair use of its tools and features, including Llama 2. If you access or use Llama 2, you agree to this Acceptable Use Policy (“Policy”). The most recent copy of this policy can be found at [ai.meta.com/llama/use-policy](http://ai.meta.com/llama/use-policy).\n\n#### Prohibited Uses\n\nWe want everyone to use Llama 2 safely and responsibly. You agree you will not use, or allow others to use, Llama 2 to:\n\n  1. Violate the law or others’ rights, including to:\n    1. Engage in, promote, generate, contribute to, encourage, plan, incite, or further illegal or unlawful activity or content, such as: \n      1. Violence or terrorism \n      2. Exploitation or harm to children, including the solicitation, creation, acquisition, or dissemination of child exploitative content or failure to report Child Sexual Abuse Material\n      3. Human trafficking, exploitation, and sexual violence\n      4. The illegal distribution of information or materials to minors, including obscene materials, or failure to employ legally required age-gating in connection with such information or materials.\n      5. Sexual solicitation\n      6. Any other criminal activity\n    2. Engage in, promote, incite, or facilitate the harassment, abuse, threatening, or bullying of individuals or groups of individuals\n    3. Engage in, promote, incite, or facilitate discrimination or other unlawful or harmful conduct in the provision of employment, employment benefits, credit, housing, other economic benefits, or other essential goods and services\n    4. Engage in the unauthorized or unlicensed practice of any profession including, but not limited to, financial, legal, medical/health, or related professional practices \n    5. Collect, process, disclose, generate, or infer health, demographic, or other sensitive personal or private information about individuals without rights and consents required by applicable laws\n    6. Engage in or facilitate any action or generate any content that infringes, misappropriates, or otherwise violates any third-party rights, including the outputs or results of any products or services using the Llama 2 Materials\n    7. Create, generate, or facilitate the creation of malicious code, malware, computer viruses or do anything else that could disable, overburden, interfere with or impair the proper working, integrity, operation or appearance of a website or computer system\n  2. Engage in, promote, incite, facilitate, or assist in the planning or development of activities that present a risk of death or bodily harm to individuals, including use of Llama 2 related to the following:\n    1. Military, warfare, nuclear industries or applications, espionage, use for materials or activities that are subject to the International Traffic Arms Regulations (ITAR) maintained by the United States Department of State\n    2. Guns and illegal weapons (including weapon development)\n    3. Illegal drugs and regulated/controlled substances\n    4. Operation of critical infrastructure, transportation technologies, or heavy machinery\n    5. Self-harm or harm to others, including suicide, cutting, and eating disorders\n    6. Any content intended to incite or promote violence, abuse, or any infliction of bodily harm to an individual\n  3. Intentionally deceive or mislead others, including use of Llama 2 related to the following:\n    1. Generating, promoting, or furthering fraud or the creation or promotion of disinformation\n    2. Generating, promoting, or furthering defamatory content, including the creation of defamatory statements, images, or other content\n    3. Generating, promoting, or further distributing spam\n    4. Impersonating another individual without consent, authorization, or legal right\n    5. Representing that the use of Llama 2 or outputs are human-generated\n    6. Generating or facilitating false online engagement, including fake reviews and other means of fake online engagement \n    7. Fail to appropriately disclose to end users any known dangers of your AI systemPlease report any violation of this Policy, software “bug,” or other problems that could lead to a violation of this Policy through one of the following means:\n     * Reporting issues with the model: [github.com/facebookresearch/llama](http://github.com/facebookresearch/llama)\n     * Reporting risky content generated by the model: [developers.facebook.com/llama_output_feedback](http://developers.facebook.com/llama_output_feedback)\n     * Reporting bugs and security concerns: [facebook.com/whitehat/info](http://facebook.com/whitehat/info)\n     * Reporting violations of the Acceptable Use Policy or unlicensed uses of Llama: LlamaUseReport@meta.com\n\n\n\n[Log in](/login?next=%2Fmeta-llama%2FLlama-2-70b-hf) or [Sign Up](/join?next=%2Fmeta-llama%2FLlama-2-70b-hf) to review the conditions and access this model content.\n\n  * [**Llama 2**](#llama-2 \"Llama 2\")\n    * [Model Details](#model-details \"Model Details\")\n    * [Intended Use](#intended-use \"Intended Use\")\n    * [Hardware and Software](#hardware-and-software \"Hardware and Software\")\n    * [Training Data](#training-data \"Training Data\")\n    * [Evaluation Results](#evaluation-results \"Evaluation Results\")\n    * [Ethical Considerations and Limitations](#ethical-considerations-and-limitations \"Ethical Considerations and Limitations\")\n    * [Reporting Issues](#reporting-issues \"Reporting Issues\")\n    * [Llama Model Index](#llama-model-index \"Llama Model Index\")\n\n\n\n#  [ ](#llama-2) **Llama 2**\n\nLlama 2 is a collection of pretrained and fine-tuned generative text models ranging in scale from 7 billion to 70 billion parameters. This is the repository for the 70B pretrained model, converted for the Hugging Face Transformers format. Links to other models can be found in the index at the bottom.\n\n##  [ ](#model-details) Model Details \n\n_Note: Use of this model is governed by the Meta license. In order to download the model weights and tokenizer, please visit the[website](https://ai.meta.com/resources/models-and-libraries/llama-downloads/) and accept our License before requesting access here._\n\nMeta developed and publicly released the Llama 2 family of large language models (LLMs), a collection of pretrained and fine-tuned generative text models ranging in scale from 7 billion to 70 billion parameters. Our fine-tuned LLMs, called Llama-2-Chat, are optimized for dialogue use cases. Llama-2-Chat models outperform open-source chat models on most benchmarks we tested, and in our human evaluations for helpfulness and safety, are on par with some popular closed-source models like ChatGPT and PaLM.\n\n**Model Developers** Meta\n\n**Variations** Llama 2 comes in a range of parameter sizes — 7B, 13B, and 70B — as well as pretrained and fine-tuned variations.\n\n**Input** Models input text only.\n\n**Output** Models generate text only.\n\n**Model Architecture** Llama 2 is an auto-regressive language model that uses an optimized transformer architecture. The tuned versions use supervised fine-tuning (SFT) and reinforcement learning with human feedback (RLHF) to align to human preferences for helpfulness and safety.\n\nTraining Data | Params | Content Length | GQA | Tokens | LR  \n---|---|---|---|---|---  \nLlama 2 | _A new mix of publicly available online data_ | 7B | 4k | ✗ | 2.0T | 3.0 x 10-4  \nLlama 2 | _A new mix of publicly available online data_ | 13B | 4k | ✗ | 2.0T | 3.0 x 10-4  \nLlama 2 | _A new mix of publicly available online data_ | 70B | 4k | ✔ | 2.0T | 1.5 x 10-4  \n  \n_Llama 2 family of models._ Token counts refer to pretraining data only. All models are trained with a global batch-size of 4M tokens. Bigger models - 70B -- use Grouped-Query Attention (GQA) for improved inference scalability.\n\n**Model Dates** Llama 2 was trained between January 2023 and July 2023.\n\n**Status** This is a static model trained on an offline dataset. Future versions of the tuned models will be released as we improve model safety with community feedback.\n\n**License** A custom commercial license is available at: <https://ai.meta.com/resources/models-and-libraries/llama-downloads/>\n\n**Research Paper** [\"Llama-2: Open Foundation and Fine-tuned Chat Models\"](/meta-llama/Llama-2-70b-hf/blob/main/arxiv.org/abs/2307.09288)\n\n##  [ ](#intended-use) Intended Use \n\n**Intended Use Cases** Llama 2 is intended for commercial and research use in English. Tuned models are intended for assistant-like chat, whereas pretrained models can be adapted for a variety of natural language generation tasks.\n\nTo get the expected features and performance for the chat versions, a specific formatting needs to be followed, including the `INST` and `<<SYS>>` tags, `BOS` and `EOS` tokens, and the whitespaces and breaklines in between (we recommend calling `strip()` on inputs to avoid double-spaces). See our reference code in github for details: [`chat_completion`](https://github.com/facebookresearch/llama/blob/main/llama/generation.py#L212).\n\n**Out-of-scope Uses** Use in any manner that violates applicable laws or regulations (including trade compliance laws).Use in languages other than English. Use in any other way that is prohibited by the Acceptable Use Policy and Licensing Agreement for Llama 2.\n\n##  [ ](#hardware-and-software) Hardware and Software \n\n**Training Factors** We used custom training libraries, Meta's Research Super Cluster, and production clusters for pretraining. Fine-tuning, annotation, and evaluation were also performed on third-party cloud compute.\n\n**Carbon Footprint** Pretraining utilized a cumulative 3.3M GPU hours of computation on hardware of type A100-80GB (TDP of 350-400W). Estimated total emissions were 539 tCO2eq, 100% of which were offset by Meta’s sustainability program.\n\nTime (GPU hours) | Power Consumption (W) | Carbon Emitted(tCO2eq)  \n---|---|---  \nLlama 2 7B | 184320 | 400 | 31.22  \nLlama 2 13B | 368640 | 400 | 62.44  \nLlama 2 70B | 1720320 | 400 | 291.42  \nTotal | 3311616 | 539.00  \n  \n**CO 2 emissions during pretraining.** Time: total GPU time required for training each model. Power Consumption: peak power capacity per GPU device for the GPUs used adjusted for power usage efficiency. 100% of the emissions are directly offset by Meta's sustainability program, and because we are openly releasing these models, the pretraining costs do not need to be incurred by others.\n\n##  [ ](#training-data) Training Data \n\n**Overview** Llama 2 was pretrained on 2 trillion tokens of data from publicly available sources. The fine-tuning data includes publicly available instruction datasets, as well as over one million new human-annotated examples. Neither the pretraining nor the fine-tuning datasets include Meta user data.\n\n**Data Freshness** The pretraining data has a cutoff of September 2022, but some tuning data is more recent, up to July 2023.\n\n##  [ ](#evaluation-results) Evaluation Results \n\nIn this section, we report the results for the Llama 1 and Llama 2 models on standard academic benchmarks.For all the evaluations, we use our internal evaluations library.\n\nModel | Size | Code | Commonsense Reasoning | World Knowledge | Reading Comprehension | Math | MMLU | BBH | AGI Eval  \n---|---|---|---|---|---|---|---|---|---  \nLlama 1 | 7B | 14.1 | 60.8 | 46.2 | 58.5 | 6.95 | 35.1 | 30.3 | 23.9  \nLlama 1 | 13B | 18.9 | 66.1 | 52.6 | 62.3 | 10.9 | 46.9 | 37.0 | 33.9  \nLlama 1 | 33B | 26.0 | 70.0 | 58.4 | 67.6 | 21.4 | 57.8 | 39.8 | 41.7  \nLlama 1 | 65B | 30.7 | 70.7 | 60.5 | 68.6 | 30.8 | 63.4 | 43.5 | 47.6  \nLlama 2 | 7B | 16.8 | 63.9 | 48.9 | 61.3 | 14.6 | 45.3 | 32.6 | 29.3  \nLlama 2 | 13B | 24.5 | 66.9 | 55.4 | 65.8 | 28.7 | 54.8 | 39.4 | 39.1  \nLlama 2 | 70B | **37.5** | **71.9** | **63.6** | **69.4** | **35.2** | **68.9** | **51.2** | **54.2**  \n  \n**Overall performance on grouped academic benchmarks.** _Code:_ We report the average pass@1 scores of our models on HumanEval and MBPP. _Commonsense Reasoning:_ We report the average of PIQA, SIQA, HellaSwag, WinoGrande, ARC easy and challenge, OpenBookQA, and CommonsenseQA. We report 7-shot results for CommonSenseQA and 0-shot results for all other benchmarks. _World Knowledge:_ We evaluate the 5-shot performance on NaturalQuestions and TriviaQA and report the average. _Reading Comprehension:_ For reading comprehension, we report the 0-shot average on SQuAD, QuAC, and BoolQ. _MATH:_ We report the average of the GSM8K (8 shot) and MATH (4 shot) benchmarks at top 1.\n\nTruthfulQA | Toxigen  \n---|---  \nLlama 1 | 7B | 27.42 | 23.00  \nLlama 1 | 13B | 41.74 | 23.08  \nLlama 1 | 33B | 44.19 | 22.57  \nLlama 1 | 65B | 48.71 | 21.77  \nLlama 2 | 7B | 33.29 | **21.25**  \nLlama 2 | 13B | 41.86 | 26.10  \nLlama 2 | 70B | **50.18** | 24.60  \n  \n**Evaluation of pretrained LLMs on automatic safety benchmarks.** For TruthfulQA, we present the percentage of generations that are both truthful and informative (the higher the better). For ToxiGen, we present the percentage of toxic generations (the smaller the better).\n\nTruthfulQA | Toxigen  \n---|---  \nLlama-2-Chat | 7B | 57.04 | **0.00**  \nLlama-2-Chat | 13B | 62.18 | **0.00**  \nLlama-2-Chat | 70B | **64.14** | 0.01  \n  \n**Evaluation of fine-tuned LLMs on different safety datasets.** Same metric definitions as above.\n\n##  [ ](#ethical-considerations-and-limitations) Ethical Considerations and Limitations \n\nLlama 2 is a new technology that carries risks with use. Testing conducted to date has been in English, and has not covered, nor could it cover all scenarios. For these reasons, as with all LLMs, Llama 2’s potential outputs cannot be predicted in advance, and the model may in some instances produce inaccurate, biased or other objectionable responses to user prompts. Therefore, before deploying any applications of Llama 2, developers should perform safety testing and tuning tailored to their specific applications of the model.\n\nPlease see the Responsible Use Guide available at [https://ai.meta.com/llama/responsible-use-guide/](https://ai.meta.com/llama/responsible-use-guide)\n\n##  [ ](#reporting-issues) Reporting Issues \n\nPlease report any software “bug,” or other problems with the models through one of the following means:\n\n  * Reporting issues with the model: [github.com/facebookresearch/llama](http://github.com/facebookresearch/llama)\n  * Reporting problematic content generated by the model: [developers.facebook.com/llama_output_feedback](http://developers.facebook.com/llama_output_feedback)\n  * Reporting bugs and security concerns: [facebook.com/whitehat/info](http://facebook.com/whitehat/info)\n\n\n\n##  [ ](#llama-model-index) Llama Model Index \n\nModel | Llama2 | Llama2-hf | Llama2-chat | Llama2-chat-hf  \n---|---|---|---|---  \n7B | [Link](https://huggingface.co/meta-llama/Llama-2-7b) | [Link](https://huggingface.co/meta-llama/Llama-2-7b-hf) | [Link](https://huggingface.co/meta-llama/Llama-2-7b-chat) | [Link](https://huggingface.co/meta-llama/Llama-2-7b-chat-hf)  \n13B | [Link](https://huggingface.co/meta-llama/Llama-2-13b) | [Link](https://huggingface.co/meta-llama/Llama-2-13b-hf) | [Link](https://huggingface.co/meta-llama/Llama-2-13b-chat) | [Link](https://huggingface.co/meta-llama/Llama-2-13b-chat-hf)  \n70B | [Link](https://huggingface.co/meta-llama/Llama-2-70b) | [Link](https://huggingface.co/meta-llama/Llama-2-70b-hf) | [Link](https://huggingface.co/meta-llama/Llama-2-70b-chat) | [Link](https://huggingface.co/meta-llama/Llama-2-70b-chat-hf)  \n  \nDownloads last month\n    104,155 \n\nSafetensors[](https://huggingface.co/docs/safetensors)\n\nModel size\n\n69B params\n\nTensor type\n\nFP16 \n\n·\n\nF32 \n\n·\n\nInference API [](https://huggingface.co/docs/hub/models-widgets#example-outputs)\n\ncold \n\n[ Text Generation](/tasks/text-generation \"Learn more about text-generation\")\n\nExamples\n\nI like traveling by train because\n\n`⌘+Enter`\n\nView Code\n\n0.7s\n\nMaximize\n\n##  Model tree for meta-llama/Llama-2-70b-hf [](/docs/hub/model-cards#specifying-a-base-model)\n\nAdapters\n\n[21 models](/models?other=base_model:adapter:meta-llama/Llama-2-70b-hf)\n\nFinetunes\n\n[28 models](/models?other=base_model:finetune:meta-llama/Llama-2-70b-hf)\n\nMerges\n\n[8 models](/models?other=base_model:merge:meta-llama/Llama-2-70b-hf)\n\nQuantizations\n\n[5 models](/models?other=base_model:quantized:meta-llama/Llama-2-70b-hf)\n\n##  Spaces using meta-llama/Llama-2-70b-hf 100\n\n[🏆 Intel/low_bit_open_llm_leaderboard](/spaces/Intel/low_bit_open_llm_leaderboard)[🏆 eduagarcia/open_pt_llm_leaderboard](/spaces/eduagarcia/open_pt_llm_leaderboard)[🏆 BAAI/open_cn_llm_leaderboard](/spaces/BAAI/open_cn_llm_leaderboard)[💽 Illia56/Ask-AI-Youtube](/spaces/Illia56/Ask-AI-Youtube)[🥇 logikon/open_cot_leaderboard](/spaces/logikon/open_cot_leaderboard)[💃 EvanTHU/MotionLLM](/spaces/EvanTHU/MotionLLM)[🧮 genai-impact/ecologits-calculator](/spaces/genai-impact/ecologits-calculator)[🐑 allenai/URIAL-Bench](/spaces/allenai/URIAL-Bench)[💬 allenai/BaseChat](/spaces/allenai/BaseChat)[💊🐰⚕️ AIM-Harvard/rabbits-leaderboard](/spaces/AIM-Harvard/rabbits-leaderboard)[😻 GTBench/GTBench](/spaces/GTBench/GTBench)[🏆 Vikhrmodels/small-shlepa-lb](/spaces/Vikhrmodels/small-shlepa-lb) + 95 Spaces + 88 Spaces\n\n##  Collections including meta-llama/Llama-2-70b-hf\n\n#### [Llama 2 Family Collection  This collection hosts the transformers and original repos of the Llama 2 and Llama Guard releases •  13 items •  Updated Dec 6, 2024 • 77](/collections/meta-llama/llama-2-family-661da1f90a9d678b6f55773b)\n\n#### [Meta's Llama2 models Collection  12 items •  Updated Dec 13, 2024 • 35](/collections/meta-llama/metas-llama2-models-675bfd70e574a62dd0e40541)\n\nSystem theme \n\nCompany\n\n[TOS](/terms-of-service) [Privacy](/privacy) [About](/huggingface) [Jobs](https://apply.workable.com/huggingface/) [](/)\n\nWebsite\n\n[Models](/models) [Datasets](/datasets) [Spaces](/spaces) [Pricing](/pricing) [Docs](/docs)\n",
    "content_quality_score": 0.8,
    "summary": null,
    "child_urls": [
        "https://huggingface.co/",
        "https://huggingface.co/models",
        "https://huggingface.co/datasets",
        "https://huggingface.co/spaces",
        "https://huggingface.co/posts",
        "https://huggingface.co/docs",
        "https://huggingface.co/enterprise",
        "https://huggingface.co/pricing",
        "https://huggingface.co/login",
        "https://huggingface.co/join",
        "https://huggingface.co/meta-llama",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf",
        "https://huggingface.co/models?pipeline_tag=text-generation",
        "https://huggingface.co/models?library=transformers",
        "https://huggingface.co/models?library=pytorch",
        "https://huggingface.co/models?library=safetensors",
        "https://huggingface.co/models?language=en",
        "https://huggingface.co/models?other=llama",
        "https://huggingface.co/models?other=facebook",
        "https://huggingface.co/models?other=meta",
        "https://huggingface.co/models?other=llama-2",
        "https://huggingface.co/models?other=text-generation-inference",
        "https://huggingface.co/models?other=endpoints_compatible",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/tree/main",
        "https://huggingface.co/login?next=%2Fmeta-llama%2FLlama-2-70b-hf",
        "https://huggingface.co/join?next=%2Fmeta-llama%2FLlama-2-70b-hf",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#llama-2",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#model-details",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#intended-use",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#hardware-and-software",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#training-data",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#evaluation-results",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#ethical-considerations-and-limitations",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#reporting-issues",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/#llama-model-index",
        "https://huggingface.co/meta-llama/Llama-2-70b-hf/blob/main/arxiv.org/abs/2307.09288",
        "https://huggingface.co/meta-llama/Llama-2-7b",
        "https://huggingface.co/meta-llama/Llama-2-7b-hf",
        "https://huggingface.co/meta-llama/Llama-2-7b-chat",
        "https://huggingface.co/meta-llama/Llama-2-7b-chat-hf",
        "https://huggingface.co/meta-llama/Llama-2-13b",
        "https://huggingface.co/meta-llama/Llama-2-13b-hf",
        "https://huggingface.co/meta-llama/Llama-2-13b-chat",
        "https://huggingface.co/meta-llama/Llama-2-13b-chat-hf",
        "https://huggingface.co/meta-llama/Llama-2-70b",
        "https://huggingface.co/meta-llama/Llama-2-70b-chat",
        "https://huggingface.co/meta-llama/Llama-2-70b-chat-hf",
        "https://huggingface.co/docs/safetensors",
        "https://huggingface.co/docs/hub/models-widgets#example-outputs",
        "https://huggingface.co/tasks/text-generation",
        "https://huggingface.co/docs/hub/model-cards#specifying-a-base-model",
        "https://huggingface.co/models?other=base_model:adapter:meta-llama/Llama-2-70b-hf",
        "https://huggingface.co/models?other=base_model:finetune:meta-llama/Llama-2-70b-hf",
        "https://huggingface.co/models?other=base_model:merge:meta-llama/Llama-2-70b-hf",
        "https://huggingface.co/models?other=base_model:quantized:meta-llama/Llama-2-70b-hf",
        "https://huggingface.co/spaces/Intel/low_bit_open_llm_leaderboard",
        "https://huggingface.co/spaces/eduagarcia/open_pt_llm_leaderboard",
        "https://huggingface.co/spaces/BAAI/open_cn_llm_leaderboard",
        "https://huggingface.co/spaces/Illia56/Ask-AI-Youtube",
        "https://huggingface.co/spaces/logikon/open_cot_leaderboard",
        "https://huggingface.co/spaces/EvanTHU/MotionLLM",
        "https://huggingface.co/spaces/genai-impact/ecologits-calculator",
        "https://huggingface.co/spaces/allenai/URIAL-Bench",
        "https://huggingface.co/spaces/allenai/BaseChat",
        "https://huggingface.co/spaces/AIM-Harvard/rabbits-leaderboard",
        "https://huggingface.co/spaces/GTBench/GTBench",
        "https://huggingface.co/spaces/Vikhrmodels/small-shlepa-lb",
        "https://huggingface.co/collections/meta-llama/llama-2-family-661da1f90a9d678b6f55773b",
        "https://huggingface.co/collections/meta-llama/metas-llama2-models-675bfd70e574a62dd0e40541",
        "https://huggingface.co/terms-of-service",
        "https://huggingface.co/privacy",
        "https://huggingface.co/huggingface",
        "https://www.facebook.com/privacy/policy/",
        "https://ai.meta.com/resources/models-and-libraries/llama-downloads/",
        "https://ai.meta.com/llama/use-policy",
        "http://ai.meta.com/llama/use-policy",
        "http://github.com/facebookresearch/llama",
        "http://developers.facebook.com/llama_output_feedback",
        "http://facebook.com/whitehat/info",
        "mailto:LlamaUseReport@meta.com",
        "https://github.com/facebookresearch/llama/blob/main/llama/generation.py#L212",
        "https://ai.meta.com/llama/responsible-use-guide",
        "https://apply.workable.com/huggingface/"
    ]
}