{
    "id": "ead12b8453acff9ecd5ff2b2c51efc27",
    "metadata": {
        "id": "ead12b8453acff9ecd5ff2b2c51efc27",
        "url": "https://www.anthropic.com/news/contextual-retrieval/",
        "title": "Introducing Contextual Retrieval \\ Anthropic",
        "properties": {
            "description": "Anthropic is an AI safety and research company that's working to build reliable, interpretable, and steerable AI systems.",
            "keywords": null,
            "author": null,
            "og:title": "Introducing Contextual Retrieval",
            "og:description": "Anthropic is an AI safety and research company that's working to build reliable, interpretable, and steerable AI systems.",
            "og:image": "https://cdn.sanity.io/images/4zrzovbb/website/519f63e0ea393f33e56c2e812713d65dcf27a79a-2880x1620.png",
            "og:image:alt": "Anthropic logo",
            "og:type": "website",
            "twitter:card": "summary_large_image",
            "twitter:site": "@AnthropicAI",
            "twitter:creator": "@AnthropicAI",
            "twitter:title": "Introducing Contextual Retrieval",
            "twitter:description": "Anthropic is an AI safety and research company that's working to build reliable, interpretable, and steerable AI systems.",
            "twitter:image": "https://cdn.sanity.io/images/4zrzovbb/website/519f63e0ea393f33e56c2e812713d65dcf27a79a-2880x1620.png",
            "twitter:image:alt": "Anthropic logo"
        }
    },
    "parent_metadata": {
        "id": "ae2a3d23ccef2ee8f856b947ee117deb",
        "url": "https://www.notion.so/RAG-ae2a3d23ccef2ee8f856b947ee117deb",
        "title": "RAG",
        "properties": {
            "Type": [
                "Leaf"
            ]
        }
    },
    "content": "[](/)\n\n[Claude](/claude)\n\n[Overview](/claude)[Team](/team)[Enterprise](/enterprise)[API](/api)[Pricing](/pricing)\n\n[Research](/research)[Company](/company)[Careers](/careers)[News](/news)[Try Claude](https://claude.ai/)\n\nProductAnnouncements\n\n# Introducing Contextual Retrieval\n\n19 Sept 2024●10 min read\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F519f63e0ea393f33e56c2e812713d65dcf27a79a-2880x1620.png&w=3840&q=75)\n\nFor an AI model to be useful in specific contexts, it often needs access to background knowledge. For example, customer support chatbots need knowledge about the specific business they're being used for, and legal analyst bots need to know about a vast array of past cases.\n\nDevelopers typically enhance an AI model's knowledge using Retrieval-Augmented Generation (RAG). RAG is a method that retrieves relevant information from a knowledge base and appends it to the user's prompt, significantly enhancing the model's response. The problem is that traditional RAG solutions remove context when encoding information, which often results in the system failing to retrieve the relevant information from the knowledge base.\n\nIn this post, we outline a method that dramatically improves the retrieval step in RAG. The method is called “Contextual Retrieval” and uses two sub-techniques: Contextual Embeddings and Contextual BM25. This method can reduce the number of failed retrievals by 49% and, when combined with reranking, by 67%. These represent significant improvements in retrieval accuracy, which directly translates to better performance in downstream tasks. \n\nYou can easily deploy your own Contextual Retrieval solution with Claude with [our cookbook](https://github.com/anthropics/anthropic-cookbook/tree/main/skills/contextual-embeddings).\n\n### A note on simply using a longer prompt\n\nSometimes the simplest solution is the best. If your knowledge base is smaller than 200,000 tokens (about 500 pages of material), you can just include the entire knowledge base in the prompt that you give the model, with no need for RAG or similar methods.\n\nA few weeks ago, we released [prompt caching](https://docs.anthropic.com/en/docs/build-with-claude/prompt-caching) for Claude, which makes this approach significantly faster and more cost-effective. Developers can now cache frequently used prompts between API calls, reducing latency by > 2x and costs by up to 90% (you can see how it works by reading our [prompt caching cookbook](https://github.com/anthropics/anthropic-cookbook/blob/main/misc/prompt_caching.ipynb)).\n\nHowever, as your knowledge base grows, you'll need a more scalable solution. That’s where Contextual Retrieval comes in.\n\n## A primer on RAG: scaling to larger knowledge bases\n\nFor larger knowledge bases that don't fit within the context window, RAG is the typical solution. RAG works by preprocessing a knowledge base using the following steps:\n\n  1. Break down the knowledge base (the “corpus” of documents) into smaller chunks of text, usually no more than a few hundred tokens;\n  2. Use an embedding model to convert these chunks into vector embeddings that encode meaning;\n  3. Store these embeddings in a vector database that allows for searching by semantic similarity.\n\n\n\nAt runtime, when a user inputs a query to the model, the vector database is used to find the most relevant chunks based on semantic similarity to the query. Then, the most relevant chunks are added to the prompt sent to the generative model.\n\nWhile embedding models excel at capturing semantic relationships, they can miss crucial exact matches. Fortunately, there’s an older technique that can assist in these situations. BM25 (Best Matching 25) is a ranking function that uses lexical matching to find precise word or phrase matches. It's particularly effective for queries that include unique identifiers or technical terms.\n\nBM25 works by building upon the TF-IDF (Term Frequency-Inverse Document Frequency) concept. TF-IDF measures how important a word is to a document in a collection. BM25 refines this by considering document length and applying a saturation function to term frequency, which helps prevent common words from dominating the results.\n\nHere’s how BM25 can succeed where semantic embeddings fail: Suppose a user queries \"Error code TS-999\" in a technical support database. An embedding model might find content about error codes in general, but could miss the exact \"TS-999\" match. BM25 looks for this specific text string to identify the relevant documentation.\n\nRAG solutions can more accurately retrieve the most applicable chunks by combining the embeddings and BM25 techniques using the following steps:\n\n  1. Break down the knowledge base (the \"corpus\" of documents) into smaller chunks of text, usually no more than a few hundred tokens;\n  2. Create TF-IDF encodings and semantic embeddings for these chunks;\n  3. Use BM25 to find top chunks based on exact matches;\n  4. Use embeddings to find top chunks based on semantic similarity;\n  5. Combine and deduplicate results from (3) and (4) using rank fusion techniques;\n  6. Add the top-K chunks to the prompt to generate the response.\n\n\n\nBy leveraging both BM25 and embedding models, traditional RAG systems can provide more comprehensive and accurate results, balancing precise term matching with broader semantic understanding.\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F45603646e979c62349ce27744a940abf30200d57-3840x2160.png&w=3840&q=75)A Standard Retrieval-Augmented Generation (RAG) system that uses both embeddings and Best Match 25 (BM25) to retrieve information. TF-IDF (term frequency-inverse document frequency) measures word importance and forms the basis for BM25.\n\nThis approach allows you to cost-effectively scale to enormous knowledge bases, far beyond what could fit in a single prompt. But these traditional RAG systems have a significant limitation: they often destroy context.\n\n### The context conundrum in traditional RAG\n\nIn traditional RAG, documents are typically split into smaller chunks for efficient retrieval. While this approach works well for many applications, it can lead to problems when individual chunks lack sufficient context.\n\nFor example, imagine you had a collection of financial information (say, U.S. SEC filings) embedded in your knowledge base, and you received the following question: _\"What was the revenue growth for ACME Corp in Q2 2023?\"_\n\nA relevant chunk might contain the text: _\"The company's revenue grew by 3% over the previous quarter.\"_ However, this chunk on its own doesn't specify which company it's referring to or the relevant time period, making it difficult to retrieve the right information or use the information effectively.\n\n## Introducing Contextual Retrieval\n\nContextual Retrieval solves this problem by prepending chunk-specific explanatory context to each chunk before embedding (“Contextual Embeddings”) and creating the BM25 index (“Contextual BM25”).\n\nLet’s return to our SEC filings collection example. Here's an example of how a chunk might be transformed:\n\n```\n`original_chunk = \"The company's revenue grew by 3% over the previous quarter.\" contextualized_chunk = \"This chunk is from an SEC filing on ACME corp's performance in Q2 2023; the previous quarter's revenue was $314 million. The company's revenue grew by 3% over the previous quarter.\"`\n```\n\nCopy\n\nIt is worth noting that other approaches to using context to improve retrieval have been proposed in the past. Other proposals include: [adding generic document summaries to chunks](https://aclanthology.org/W02-0405.pdf) (we experimented and saw very limited gains), [hypothetical document embedding](https://arxiv.org/abs/2212.10496), and [summary-based indexing](https://www.llamaindex.ai/blog/a-new-document-summary-index-for-llm-powered-qa-systems-9a32ece2f9ec) (we evaluated and saw low performance). These methods differ from what is proposed in this post.\n\n### Implementing Contextual Retrieval\n\nOf course, it would be far too much work to manually annotate the thousands or even millions of chunks in a knowledge base. To implement Contextual Retrieval, we turn to Claude. We’ve written a prompt that instructs the model to provide concise, chunk-specific context that explains the chunk using the context of the overall document. We used the following Claude 3 Haiku prompt to generate context for each chunk:\n\n```\n`<document> {{WHOLE_DOCUMENT}} </document> Here is the chunk we want to situate within the whole document <chunk> {{CHUNK_CONTENT}} </chunk> Please give a short succinct context to situate this chunk within the overall document for the purposes of improving search retrieval of the chunk. Answer only with the succinct context and nothing else. `\n```\n\nCopy\n\nThe resulting contextual text, usually 50-100 tokens, is prepended to the chunk before embedding it and before creating the BM25 index.\n\nHere’s what the preprocessing flow looks like in practice:\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F2496e7c6fedd7ffaa043895c23a4089638b0c21b-3840x2160.png&w=3840&q=75)_Contextual Retrieval is a preprocessing technique that improves retrieval accuracy._\n\nIf you’re interested in using Contextual Retrieval, you can get started with [our cookbook](https://github.com/anthropics/anthropic-cookbook/tree/main/skills/contextual-embeddings).\n\n### Using Prompt Caching to reduce the costs of Contextual Retrieval\n\nContextual Retrieval is uniquely possible at low cost with Claude, thanks to the special prompt caching feature we mentioned above. With prompt caching, you don’t need to pass in the reference document for every chunk. You simply load the document into the cache once and then reference the previously cached content. Assuming 800 token chunks, 8k token documents, 50 token context instructions, and 100 tokens of context per chunk, **the one-time cost to generate contextualized chunks is $1.02 per million document tokens**.\n\n#### Methodology\n\nWe experimented across various knowledge domains (codebases, fiction, ArXiv papers, Science Papers), embedding models, retrieval strategies, and evaluation metrics. We’ve included a few examples of the questions and answers we used for each domain in [Appendix II](https://assets.anthropic.com/m/1632cded0a125333/original/Contextual-Retrieval-Appendix-2.pdf).\n\nThe graphs below show the average performance across all knowledge domains with the top-performing embedding configuration (Gemini Text 004) and retrieving the top-20-chunks. We use 1 minus recall@20 as our evaluation metric, which measures the percentage of relevant documents that fail to be retrieved within the top 20 chunks. You can see the full results in the appendix - contextualizing improves performance in every embedding-source combination we evaluated.\n\n#### Performance improvements\n\nOur experiments showed that:\n\n  * **Contextual Embeddings reduced the top-20-chunk retrieval failure rate by 35%** (5.7% → 3.7%).\n  * **Combining Contextual Embeddings and Contextual BM25 reduced the top-20-chunk retrieval failure rate by 49%** (5.7% → 2.9%).\n\n\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F7f8d739e491fe6b3ba0e6a9c74e4083d760b88c9-3840x2160.png&w=3840&q=75)_Combining Contextual Embedding and Contextual BM25 reduce the top-20-chunk retrieval failure rate by 49%._\n\n#### Implementation considerations\n\nWhen implementing Contextual Retrieval, there are a few considerations to keep in mind:\n\n  1. **Chunk boundaries:** Consider how you split your documents into chunks. The choice of chunk size, chunk boundary, and chunk overlap can affect retrieval performance1.\n  2. **Embedding model:** Whereas Contextual Retrieval improves performance across all embedding models we tested, some models may benefit more than others. We found [Gemini](https://ai.google.dev/gemini-api/docs/embeddings) and [Voyage](https://www.voyageai.com/) embeddings to be particularly effective.\n  3. **Custom contextualizer prompts:** While the generic prompt we provided works well, you may be able to achieve even better results with prompts tailored to your specific domain or use case (for example, including a glossary of key terms that might only be defined in other documents in the knowledge base).\n  4. **Number of chunks:** Adding more chunks into the context window increases the chances that you include the relevant information. However, more information can be distracting for models so there's a limit to this. We tried delivering 5, 10, and 20 chunks, and found using 20 to be the most performant of these options (see appendix for comparisons) but it’s worth experimenting on your use case.\n\n\n\n**Always run evals:** Response generation may be improved by passing it the contextualized chunk and distinguishing between what is context and what is the chunk.\n\n## Further boosting performance with Reranking\n\nIn a final step, we can combine Contextual Retrieval with another technique to give even more performance improvements. In traditional RAG, the AI system searches its knowledge base to find the potentially relevant information chunks. With large knowledge bases, this initial retrieval often returns a lot of chunks—sometimes hundreds—of varying relevance and importance.\n\nReranking is a commonly used filtering technique to ensure that only the most relevant chunks are passed to the model. Reranking provides better responses and reduces cost and latency because the model is processing less information. The key steps are:\n\n  1. Perform initial retrieval to get the top potentially relevant chunks (we used the top 150);\n  2. Pass the top-N chunks, along with the user's query, through the reranking model;\n  3. Using a reranking model, give each chunk a score based on its relevance and importance to the prompt, then select the top-K chunks (we used the top 20);\n  4. Pass the top-K chunks into the model as context to generate the final result.\n\n\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F8f82c6175a64442ceff4334b54fac2ab3436a1d1-3840x2160.png&w=3840&q=75)_Combine Contextual Retrieva and Reranking to maximize retrieval accuracy._\n\n### Performance improvements\n\nThere are several reranking models on the market. We ran our tests with the [Cohere reranker](https://cohere.com/rerank). Voyage[ also offers a reranker](https://docs.voyageai.com/docs/reranker), though we did not have time to test it. Our experiments showed that, across various domains, adding a reranking step further optimizes retrieval.\n\nSpecifically, we found that Reranked Contextual Embedding and Contextual BM25 reduced the top-20-chunk retrieval failure rate by 67% (5.7% → 1.9%).\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F93a70cfbb7cca35bb8d86ea0a23bdeeb699e8e58-3840x2160.png&w=3840&q=75)_Reranked Contextual Embedding and Contextual BM25 reduces the top-20-chunk retrieval failure rate by 67%._\n\n#### Cost and latency considerations\n\nOne important consideration with reranking is the impact on latency and cost, especially when reranking a large number of chunks. Because reranking adds an extra step at runtime, it inevitably adds a small amount of latency, even though the reranker scores all the chunks in parallel. There is an inherent trade-off between reranking more chunks for better performance vs. reranking fewer for lower latency and cost. We recommend experimenting with different settings on your specific use case to find the right balance.\n\n## Conclusion\n\nWe ran a large number of tests, comparing different combinations of all the techniques described above (embedding model, use of BM25, use of contextual retrieval, use of a reranker, and total # of top-K results retrieved), all across a variety of different dataset types. Here’s a summary of what we found:\n\n  1. Embeddings+BM25 is better than embeddings on their own;\n  2. Voyage and Gemini have the best embeddings of the ones we tested;\n  3. Passing the top-20 chunks to the model is more effective than just the top-10 or top-5;\n  4. Adding context to chunks improves retrieval accuracy a lot;\n  5. Reranking is better than no reranking;\n  6. **All these benefits stack** : to maximize performance improvements, we can combine contextual embeddings (from Voyage or Gemini) with contextual BM25, plus a reranking step, and adding the 20 chunks to the prompt.\n\n\n\nWe encourage all developers working with knowledge bases to use [our cookbook](https://github.com/anthropics/anthropic-cookbook/tree/main/skills/contextual-embeddings) to experiment with these approaches to unlock new levels of performance.\n\n## Appendix I\n\nBelow is a breakdown of results across datasets, embedding providers, use of BM25 in addition to embeddings, use of contextual retrieval, and use of reranking for Retrievals @ 20.\n\nSee [Appendix II](https://assets.anthropic.com/m/1632cded0a125333/original/Contextual-Retrieval-Appendix-2.pdf) for the breakdowns for Retrievals @ 10 and @ 5 as well as example questions and answers for each dataset.\n\n![](/_next/image?url=https%3A%2F%2Fwww-cdn.anthropic.com%2Fimages%2F4zrzovbb%2Fwebsite%2F646a894ec4e6120cade9951a362f685cd2ec89b2-2458x2983.png&w=3840&q=75)_1 minus recall @ 20 results across data sets and embedding providers._\n\n#### Footnotes\n\n1. For additional reading on chunking strategies, check out [this link](https://www.pinecone.io/learn/chunking-strategies/) and [this link](https://research.trychroma.com/evaluating-chunking).\n\n[](https://twitter.com/intent/tweet?text=https://www.anthropic.com/news/contextual-retrieval)[](https://www.linkedin.com/shareArticle?mini=true&url=https://www.anthropic.com/news/contextual-retrieval)\n\n[](/)\n\n  * [Claude](/claude)\n  * [API ](/api)\n  * [Team](/team)\n  * [Pricing](/pricing)\n  * [Research](/research)\n  * [Company](/company)\n  * [Customers](/customers)\n  * [News](/news)\n  * [Careers](/careers)\n\n\n  * Press Inquiries\n  * [Support](https://support.anthropic.com/)\n  * [Status](https://status.anthropic.com/)\n  * [Availability](/supported-countries)\n  * [Twitter](https://twitter.com/AnthropicAI)\n  * [LinkedIn](https://www.linkedin.com/company/anthropicresearch)\n  * [YouTube](https://www.youtube.com/@anthropic-ai)\n\n\n  * [Terms of Service – Consumer](/legal/consumer-terms)\n  * [Terms of Service – Commercial](/legal/commercial-terms)\n  * [Privacy Policy](/legal/privacy)\n  * [Usage Policy](/legal/aup)\n  * [Responsible Disclosure Policy](/responsible-disclosure-policy)\n  * [Compliance](https://trust.anthropic.com/)\n  * Privacy Choices\n\n### Cookie Settings\n\nWe use cookies to deliver and improve our services, analyze site usage, and if you agree, to customize or personalize your experience and market our services to you. You can read our Cookie Policy [here](https://www.anthropic.com/legal/cookies).\n\nCustomize cookie settingsReject all cookiesAccept all cookies\n\n\n\n\n© 2025 Anthropic PBC\n",
    "content_quality_score": 1.0,
    "summary": null,
    "child_urls": [
        "https://www.anthropic.com/",
        "https://www.anthropic.com/claude",
        "https://www.anthropic.com/team",
        "https://www.anthropic.com/enterprise",
        "https://www.anthropic.com/api",
        "https://www.anthropic.com/pricing",
        "https://www.anthropic.com/research",
        "https://www.anthropic.com/company",
        "https://www.anthropic.com/careers",
        "https://www.anthropic.com/news",
        "https://www.anthropic.com/customers",
        "https://www.anthropic.com/supported-countries",
        "https://www.anthropic.com/legal/consumer-terms",
        "https://www.anthropic.com/legal/commercial-terms",
        "https://www.anthropic.com/legal/privacy",
        "https://www.anthropic.com/legal/aup",
        "https://www.anthropic.com/responsible-disclosure-policy",
        "https://www.anthropic.com/legal/cookies",
        "https://claude.ai/",
        "https://github.com/anthropics/anthropic-cookbook/tree/main/skills/contextual-embeddings",
        "https://docs.anthropic.com/en/docs/build-with-claude/prompt-caching",
        "https://github.com/anthropics/anthropic-cookbook/blob/main/misc/prompt_caching.ipynb",
        "https://aclanthology.org/W02-0405.pdf",
        "https://arxiv.org/abs/2212.10496",
        "https://www.llamaindex.ai/blog/a-new-document-summary-index-for-llm-powered-qa-systems-9a32ece2f9ec",
        "https://assets.anthropic.com/m/1632cded0a125333/original/Contextual-Retrieval-Appendix-2.pdf",
        "https://ai.google.dev/gemini-api/docs/embeddings",
        "https://www.voyageai.com/",
        "https://cohere.com/rerank",
        "https://docs.voyageai.com/docs/reranker",
        "https://www.pinecone.io/learn/chunking-strategies/",
        "https://research.trychroma.com/evaluating-chunking",
        "https://twitter.com/intent/tweet?text=https://www.anthropic.com/news/contextual-retrieval",
        "https://www.linkedin.com/shareArticle?mini=true&url=https://www.anthropic.com/news/contextual-retrieval",
        "mailto:press@anthropic.com",
        "https://support.anthropic.com/",
        "https://status.anthropic.com/",
        "https://twitter.com/AnthropicAI",
        "https://www.linkedin.com/company/anthropicresearch",
        "https://www.youtube.com/@anthropic-ai",
        "https://trust.anthropic.com/"
    ]
}