{
    "id": "f5101a9e1eddb5af884aef9f94a7bf0d",
    "metadata": {
        "id": "f5101a9e1eddb5af884aef9f94a7bf0d",
        "url": "https://arize.com/blog-course/what-is-observability-data-machine-learning/",
        "title": "What Is Observability? - Arize AI",
        "properties": {
            "description": null,
            "keywords": null,
            "author": null,
            "og:locale": "en_US",
            "og:type": "article",
            "og:title": "What Is Observability?",
            "og:description": "In 1969, humans first stepped on the moon thanks to a lot of clever engineering and 150,000 lines of code. Among other things, this code enabled engineers at mission control...",
            "og:url": "https://arize.com/blog-course/what-is-observability-data-machine-learning/",
            "og:site_name": "Arize AI",
            "og:image": "https://arize.com/wp-content/uploads/2023/02/What-Is-Observability.webp",
            "og:image:width": "935",
            "og:image:height": "832",
            "og:image:type": "image/webp",
            "twitter:card": "summary_large_image",
            "twitter:site": "@arizeai",
            "twitter:label1": "Est. reading time",
            "twitter:data1": "9 minutes",
            "twitter:label2": "Written by",
            "twitter:data2": "Aparna Dhinakaran"
        }
    },
    "parent_metadata": {
        "id": "b12adca0e4a3baebd6ade65d811fa4cb",
        "url": "https://www.notion.so/Monitoring-b12adca0e4a3baebd6ade65d811fa4cb",
        "title": "Monitoring ",
        "properties": {
            "Type": "Leaf"
        }
    },
    "content": "[_Read The Definitive Guide to LLM App Evaluation →_](https://arize.com/resource/evaluation-ebook/)\n\n[ ![Arize AI Logo](https://arize.com/wp-content/themes/arize-2022/images/logo2.svg) ](https://arize.com)\n\n  * [Products](#)\n\n    * [![]()PRODUCT](#)\n    * [Generative AI](https://arize.com/#tab--generative-ai)\n    * [ML & Computer Vision](https://arize.com/?select=ml)\n    * [Phoenix OSS](https://phoenix.arize.com/)\n\n[](https://arize.com/resource/arize-platform-demo-2/)\n\n[![]()](https://arize.com/resource/arize-platform-demo-2/)\n\n#### Arize demo\n\nSee how it works\n\n  * [Pricing](https://arize.com/pricing)\n  * [Docs](https://docs.arize.com/arize)\n  * [Learn](#)\n\n    * [![]()LEARN](#)\n    * [Blog](https://arize.com/blog/)\n    * [LLM Evals Hub](https://arize.com/llm-evaluation)\n    * [AI Fundamentals](https://arize.com/blog-course/introduction-fundamentals/)\n    * [Paper Readings](https://arize.com/ai-research-papers/)\n    * [Video Tutorials](https://arize.com/videos-llmops-tutorials/)\n    * [Courses](https://courses.arize.com/courses/)\n    * [Community & Events](https://arize.com/community/)\n\n[](https://arize.com/resource/evaluation-ebook/)\n\n[![]()](https://arize.com/resource/evaluation-ebook/)\n\n#### The Definitive Guide to LLM App Evaluation\n\nDownload the eBook\n\n  * [Company](#)\n\n    * [![]()COMPANY](#)\n    * [About](https://arize.com/about-company/)\n    * [Careers](https://arize.com/careers/)\n    * [Partners](https://arize.com/partners/)\n    * [Press](https://arize.com/press/)\n    * [Security](https://arize.com/trust-center/)\n\n[](https://arize.com/customers/)\n\n[![]()](https://arize.com/customers/)\n\n#### Customers\n\nSee who is achieving better outcomes in production.\n\n  * [Star](https://github.com/Arize-ai/phoenix)\n  * [Get a Demo](https://arize.com/request-a-demo/)\n  * [Sign in](https://app.arize.com/auth/login?redirect_uri=/)\n  * [Sign Up](https://app.arize.com/auth/join)\n\n\n\n![]()\n\n×\n\n###### ARIZE MACHINE LEARNING COURSE\n\n####  ![](https://arize.com/wp-content/themes/arize-2022/images/icon-courses.svg) The Fundamentals \n\n  * [ML Observability Course Overview](https://arize.com/blog-course/)\n  * [ML Observability Basics](#)\n    * [What Is Observability?](https://arize.com/blog-course/what-is-observability-data-machine-learning/)\n    * [ML Observability: The Essentials](https://arize.com/blog-course/machine-learning-observability-essentials/)\n    * [Tracing In Machine Learning](https://arize.com/blog-course/performance-tracing-machine-learning/)\n  * [Model Evaluation Metrics](#)\n    * [Top Model Evaluation Metrics](https://arize.com/blog-course/model-evaluation-metrics/)\n    * [Binary Cross Entropy](https://arize.com/blog-course/binary-cross-entropy-log-loss/)\n    * [Precision](https://arize.com/blog-course/precision-ml/)\n    * [Recall](https://arize.com/blog-course/precision-vs-recall/)\n    * [F1 Score](https://arize.com/blog-course/f1-score/)\n    * [Calibration Curve](https://arize.com/blog-course/what-is-calibration-reliability-curve/)\n    * [PR AUC](https://arize.com/blog/what-is-pr-auc/)\n    * [AUC ROC](https://arize.com/blog/what-is-auc/)\n    * [Mean Absolute Error](https://arize.com/blog-course/mean-absolute-error-in-machine-learning-what-you-need-to-know/)\n    * [Mean Absolute Percentage Error (MAPE)](https://arize.com/blog-course/mean-absolute-percentage-error-mape-what-you-need-to-know/)\n    * [R Squared](https://arize.com/blog-course/r-squared-understanding-the-coefficient-of-determination/)\n    * [RMSE](https://arize.com/blog-course/root-mean-square-error-rmse-what-you-need-to-know/)\n    * [Normalized Discounted Cumulative Gain (NDCG)](https://arize.com/blog-course/ndcg/)\n    * [Other Rank Aware Evaluation Metrics](https://arize.com/blog-course/monitoring-collaborative-filtering-recsys/)\n    * [Bleu Score and LLM Metrics](https://arize.com/blog-course/generative-ai-metrics-bleu-score/)\n  * [Drift Metrics](#)\n    * [Drift Metrics: a Quickstart Guide](https://arize.com/blog-course/drift/)\n    * [Data Binning](https://arize.com/blog-course/data-binning-production/)\n    * [Population Stability Index (PSI)](https://arize.com/blog-course/population-stability-index-psi/)\n    * [KL Divergence](https://arize.com/blog-course/kl-divergence/)\n    * [Jensen Shannon Divergence](https://arize.com/blog-course/jensen-shannon-divergence/)\n    * [Kolmogorov Smirnov Test](https://arize.com/blog-course/kolmogorov-smirnov-test/)\n  * [Model Fairness](#)\n    * [Algorithmic Bias](https://arize.com/blog-course/algorithmic-bias-examples-tools/)\n    * [Building Transparent AI Software Systems](https://arize.com/blog-course/transparent-ethical-ai-software-systems/)\n  * [Data Quality](https://arize.com/blog-course/data-quality-management-for-mlops/)\n  * [Service-Level Monitoring](#)\n    * [Service Monitoring Metrics](https://arize.com/blog-course/service-monitoring-metrics/)\n    * [ML Service-Level Performance Monitoring Essentials](https://arize.com/blog-course/ml-service-level-performance-monitoring/)\n  * [Explainability](#)\n    * [Explainability](https://arize.com/blog-course/explainability-xai-primer/)\n    * [Explainability Techniques](https://arize.com/blog-course/explainability-techniques-shap/)\n  * [Monitoring Image and Language Models and Embeddings](https://arize.com/blog-course/embeddings-meaning-examples-and-how-to-compute/)\n    * [KNN Algorithm](https://arize.com/blog-course/knn-algorithm-k-nearest-neighbor/)\n    * [Tokenization](https://arize.com/blog-course/tokenization/)\n    * [Embedding Versioning](https://arize.com/blog-course/embedding-versioning/)\n    * [Dimensionality Reduction](https://arize.com/blog-course/reduction-of-dimensionality-top-techniques/)\n    * [What Is LLMOps?](https://arize.com/blog-course/llmops-operationalizing-llms-at-scale/)\n    * [Monitoring Embedding/Vector Drift](https://arize.com/blog-course/embedding-drift-euclidean-distance/)\n    * [BERT](https://arize.com/blog-course/unleashing-bert-transformer-model-nlp/)\n    * [Fine-Tuning LLM Applications with LangChain](https://arize.com/blog-course/langchain-llm-agent-monitoring/)\n    * [Evals from OpenAI](https://arize.com/blog-course/evals-openai-simplifying-llm-evaluation/)\n    * [Guide To LLMs Evaluating LLMs](https://arize.com/blog-course/assessing-large-language-models/)\n\n\n  * [Certifications](#)\n    * [LLM Certification](https://courses.arize.com/courses/)\n    * [Agents, Tools, and Chains](https://courses.arize.com/p/agents-tools-and-chains)\n    * [LLM Evaluations](https://courses.arize.com/p/llm-evaluations)\n    * [Traces and Spans](https://courses.arize.com/p/llm-observability-traces-spans)\n    * [ML Observability Fundamentals](https://arize.com/ml-observability-fundamentals/)\n    * [Advanced Model Performance Metrics](https://courses.arize.com/p/ml-observability-advanced-metrics-course)\n  * [New to Arize?](#)\n    * [Arize onboarding](https://docs.arize.com/arize/quickstart)\n\n\n\n#  What Is Observability? \n\n![](https://arize.com/wp-content/uploads/2020/12/bg-speaker-98x98.png)\n\n[ Aparna Dhinakaran, ](https://arize.com/author/aparna-dhinakaran/) Co-founder & Chief Product Officer  | Published February 02, 2023\n\nIn 1969, humans first stepped on the moon thanks to a lot of clever engineering and 150,000 lines of code. Among other things, this code enabled engineers at mission control to have the full view of the mission and make near-real-time decisions. The amount of code was so small that engineers were able to thoroughly debug the software, and its performance was nearly flawless. Today’s search engines, on the other hand, execute billions of lines of code, making it much more likely that engineers will make mistakes or extraordinary circumstances will crop up somewhere in the system. On top of that, both data and machine learning models (code that computers essentially write for themselves) come with their own challenges. In short, it is nearly impossible to guarantee that a modern software system will always perform as you expect. That’s why observability is crucial on all production systems.\n\nLuckily, we can automate observability of complex software systems so you can have timely and actionable information about your software, just like NASA engineers had about the Apollo missions.\n\n## What Is Observability?\n\nObservability is the practice of quickly finding out what the problem is and getting to the root cause. Most modern software systems include infrastructure, data, and machine learning models. All three need observability, but each has different requirements, workflows, and personas. Let’s take a closer look!\n\n![](https://arize.com/wp-content/uploads/2021/05/observability-iceberg-2.png)\n\n## What are the Types of Observability?\n\nObservability is of course not unique to technical personas like DevOps, data engineers, and MLOps engineers. It is the same discipline used in tracking business metrics and industry-specific requirements, but in this post we will focus on what observability means to people in these three more technical roles.\n\nThe three types of engineers use observability to solve different problems with distinct workflows. At the highest level, infrastructure observability is concerned with software problems that often revolve around latency, failures, and resource utilization. Data observability, on the other hand, cares more about changes in data that your application is using, either at rest in the database or in any step that feeds into your data storage system. Machine learning observability is a newer discipline; it focuses on the performance of your models, measuring how well they predict values either on aggregate in certain slices of the data or on the level of individual predictions with techniques like SHAP analysis.\n\n![](https://arize.com/wp-content/uploads/2022/06/observability-personas-examples.jpg)\n\n## Infrastructure Observability\n\n### Persona\n\nSoftware/DevOps engineers are responsible for development and operations of software infrastructure. Their code is the mortar that holds all the bricks of modern software systems together.\n\n### Problem\n\nMany modern applications rely on several systems coming together, and a small problem in one system can show up as a significant slowdown in the overall application.\n\nA new version of the code can have unexpected bugs. Configuration changes, passwords, and rare occurrences like leap seconds can all cause troubles at this layer. Additionally, DevOps engineers are often responsible for software systems they did not design. Virtual machines or Kubernetes clusters running their code can fail.\n\n### Workflow\n\nSeveral workflows can be employed at this layer, depending on where the problem manifests. Let’s look at one of them.\n\nSay you are a DevOps engineer for a large ecommerce site—let’s call it Nile. Suddenly, pages start taking just a little bit longer to load. It is well established that a 1% slowdown on such an application can cause a 15% drop in customer satisfaction, which translates to huge loss of revenue.\n\nNo sweat—you have integrated your application with a market-leading observability solution. You get notified about the problem right away and can start troubleshooting.\n\nFirst, since you logged your page load times as well as individual query times for each query on the page, you can identify which pages load slower than others. Then you can look at individual query times and sort them by which are taking the longest.\n\nDeeper down in your system, you can identify sub-queries that are slowing you down. By analyzing the timing around these sub-traces, DevOps engineers like you are easily able to see patterns that point them to the root cause of the problem. In this case, a recent code change introduced more latency in history lookup for customers with more than 300 purchases in the last year, and thanks to tail latency amplification, all your customers paid the price. You back out the change until your team can figure out how to deploy it without incurring such costs.\n\nProblem solved.\n\n![](https://arize.com/wp-content/uploads/2022/06/system-infra-observability-4.jpg)\n\n## Data Observability\n\n### Persona\n\nData Engineers and Analytics Engineers are responsible for building and operating data pipelines. They ensure the timeliness, completeness, and other quality characteristics of the data that your application receives.\n\n### Problem\n\nWhen the original source of the data makes a change, it may alter the schema, contents, or arrival times of the data into the data lake or warehouse. For example, say your data vendor switched from US zip codes (number) to global postal codes (strings). Suddenly a step in your pipeline malfunctions because it relies on a zip code being a number or being exactly 5 digits long, and you get partial or null postal code for all your Canadian customers.\n\nOther problems can include stale data (from a pipeline not running on time), volume (accidentally dropped or duplicated records), and distribution (a negative value for a person’s age or a new categorical value). These can be caused by changes in the data’s original source, issues with the data infrastructure, or changes to the code in various transformation steps the data goes through as it moves down the pipeline.\n\nIdentifying these issues across all data pipelines, 24/7 is crucial to preventing data outages from reaching the data used by models for training and serving, and quickly scales beyond manual approaches like spot checks and even semi-automated approaches like data pipeline tests.\n\n### Workflow\n\nNow let’s say you are a data engineer for a fast-growing analytics company. You got your first huge customer, and they have just launched a crucial marketing campaign that depends on your company’s customer segmentation model. The recommendations your model serves over the next 24 hours will make a huge difference to their business and yours. And that model depends on fresh audience data to serve up.\n\nYou get an alert from your data observability tool: a table that is supposed to update every 60 minutes has not been updated in 75. Clicking the link in the alert takes you to the SLA for one of your third party data providers. You see that the data is stale, and that a similar issue happened a few months ago. Reading the incident notes your teammate left when they fixed this last time, you see which provider this data comes from, and their phone number. You pick up the phone and give them a call. Guess what? They didn’t even know they had an issue until you called. Their SSL certificate expired and the cron job they are using to renew it got stuck. They rerun the script manually, and your data observability tool confirms that everything is back to normal. Time to detect: 15 minutes. Time to fix: 10 minutes. Customer impact: negligible. No one even knows you just saved your company’s biggest deal to date.\n\n![](https://arize.com/wp-content/uploads/2022/06/data-observability-5.png)\n\n## Machine Learning Observability\n\n### Persona\n\nMachine learning engineers are responsible for developing, productionizing, and operating machine learning models.\n\n### Problem\n\nMore and more software systems rely on machine learning models. More and more economic value relies on machine learning models. A poorly performing model can lead to poor decisions or worse, loss of reputation and revenue for many customers.\n\nUnlike traditional software, however, machine learning models are not static. Performance usually degrades over time. In fact, [one survey](https://arize.com/resource/survey-machine-learning-observability-results/) has shown that on average models degrade within 10 days of being in production. It is vital to have the tools to detect problems, establish root cause, and improve models as quickly as possible.\n\n### Workflow\n\nFor this example, let’s say you are a machine learning engineer maintaining a [fraud model](https://arize.com/blog/best-practices-in-ml-observability-for-monitoring-mitigating-and-preventing-fraud/) for a major bank. Your model labels transactions as fraudulent (or not). One day your [ML observability](https://arize.com/ml-observability/) system sends you an alert. You log in and can quickly arrive at the very slice of inputs that seem to generate unexpected output distribution. Among the inputs, you can identify a new scammer. Perhaps this new scammer exhibits behaviors the model has not seen before, but you can retrain it with this new data included and catch them and anyone else who tries this scheme in the future.\n\nCollecting useful information is once again key. In this case, you are looking for model inputs and outputs over time. Once you have the data you need, having some idea of baseline performance is very useful.\n\nWhen the model performance goes outside the baseline bounds, you can zoom in on the timeframe where the issues are present. Next you would sort your data by slices and evaluate the problematic ones.\n\n![](https://arize.com/wp-content/uploads/2022/06/ml-observe-example-workflow.jpg)\n\n## Conclusion\n\nAs software becomes more integral in the world at large and in your company in particular, the need for observability grows. The level of observability required for a complex software system today necessitates automated tools. Which tools you need depends on what problems you are solving. Typically software and DevOps engineers will mainly rely on system and infrastructure observability tools. Data engineers have specific challenges that require solutions tailored for data observability. Machine learning engineers require a whole different set of tools to troubleshoot degrading model performance. And as your team and company scale, you will probably find yourself needing all three.\n\n**_This post is written in partnership with Kyle Kirwan, Co-founder and CEO at data observability platform_[ _Bigeye_](https://www.bigeye.com/)**\n\n##### On this page\n\n  * [ What Is Observability? ](https://arize.com/blog-course/what-is-observability-data-machine-learning#what-is-observability)\n  * [ Types of Observability ](https://arize.com/blog-course/what-is-observability-data-machine-learning#types-of-observability)\n  * [ Infrastructure Observability ](https://arize.com/blog-course/what-is-observability-data-machine-learning#infrastructure-observability)\n  * [ Data Observability ](https://arize.com/blog-course/what-is-observability-data-machine-learning#data-observability)\n  * [ Machine Learning Observability ](https://arize.com/blog-course/what-is-observability-data-machine-learning#machine-learning-observability)\n\n\n\n[ ![Arize icon](https://arize.com/wp-content/uploads/2023/02/Arize-icon@2x.png) Try Arize  ](https://app.arize.com/auth/join)\n\n[ ![Slack icon](https://arize.com/wp-content/uploads/2023/02/Slack-icon@2x.png) Ask any AI question  ](https://arize-ai.slack.com/)\n\n## Sign up for our monthly newsletter, The Evaluator.\n\n[Subscribe](#blog-subscribe-modal)\n\n[ ![arize logo](https://arize.com/wp-content/themes/arize-2022/images/Arize-logo.svg) ](https://arize.com)\n\n  * [Platform](https://arize.com)\n  * [Docs](https://docs.arize.com/arize)\n  * [Pricing](https://arize.com/pricing)\n  * [Phoenix](https://phoenix.arize.com/)\n\n\n\nLearn\n\n  * [Course](https://arize.com/elearning/)\n  * [Community](https://arize.com/community/)\n  * [Blog](https://arize.com/blog/)\n\n\n\nTopics\n\n  * [LLM Evaluation](https://arize.com/blog-course/llm-evaluation-the-definitive-guide/)\n  * [LLM Tracing](https://docs.arize.com/phoenix/tracing/llm-traces)\n  * [RAG Evaluation](https://arize.com/blog-course/rag-evaluation/)\n\n\n\nCompany\n\n  * [About](https://arize.com/about-company/)\n  * [Customers](https://arize.com/customers/)\n  * [Careers](https://arize.com/careers/)\n  * [Press](https://arize.com/press/)\n  * [Security](https://arize.com/trust-center/)\n\n\n\n  * [Try now](https://app.arize.com/auth/join)\n  * [Book a Demo](https://arize.com/request-a-demo/)\n  * [Sign In](https://app.arize.com/auth/login)\n  * [Contact](https://arize.com/contact/)\n  * [Privacy Policy](https://arize.com/privacy-policy/)\n  * [Twitter](https://twitter.com/arizeai?lang=en)\n  * [Linkedin](https://www.linkedin.com/company/arizeai/)\n\n\n\nCopyright © 2025 Arize AI, Inc\n\nJoin the Arize ML Observability Community \n\nSubscribe to the Arize blog \n\nSubscribe to get the latest news, expertise, and product updates from Arize. Your inbox is sacred, so we’ll only curate and send the best stuff. \n\n*We’re committed to your privacy. Arize uses the information you provide to contact you about relevant content, products, and services. You may unsubscribe from these communications at any time. For more information, check out our [privacy policy](https://arize.com/privacy-policy/).\n\nContact us \n\nLike what you see? Let’s chat. Fill out this form and we will be in contact with you soon! \n",
    "content_quality_score": 0.3,
    "summary": null,
    "child_urls": [
        "https://arize.com/resource/evaluation-ebook/",
        "https://arize.com",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning/",
        "https://arize.com/#tab--generative-ai",
        "https://arize.com/?select=ml",
        "https://phoenix.arize.com/",
        "https://arize.com/resource/arize-platform-demo-2/",
        "https://arize.com/pricing",
        "https://docs.arize.com/arize",
        "https://arize.com/blog/",
        "https://arize.com/llm-evaluation",
        "https://arize.com/blog-course/introduction-fundamentals/",
        "https://arize.com/ai-research-papers/",
        "https://arize.com/videos-llmops-tutorials/",
        "https://courses.arize.com/courses/",
        "https://arize.com/community/",
        "https://arize.com/about-company/",
        "https://arize.com/careers/",
        "https://arize.com/partners/",
        "https://arize.com/press/",
        "https://arize.com/trust-center/",
        "https://arize.com/customers/",
        "https://arize.com/request-a-demo/",
        "https://app.arize.com/auth/login?redirect_uri=/",
        "https://app.arize.com/auth/join",
        "https://arize.com/blog-course/",
        "https://arize.com/blog-course/machine-learning-observability-essentials/",
        "https://arize.com/blog-course/performance-tracing-machine-learning/",
        "https://arize.com/blog-course/model-evaluation-metrics/",
        "https://arize.com/blog-course/binary-cross-entropy-log-loss/",
        "https://arize.com/blog-course/precision-ml/",
        "https://arize.com/blog-course/precision-vs-recall/",
        "https://arize.com/blog-course/f1-score/",
        "https://arize.com/blog-course/what-is-calibration-reliability-curve/",
        "https://arize.com/blog/what-is-pr-auc/",
        "https://arize.com/blog/what-is-auc/",
        "https://arize.com/blog-course/mean-absolute-error-in-machine-learning-what-you-need-to-know/",
        "https://arize.com/blog-course/mean-absolute-percentage-error-mape-what-you-need-to-know/",
        "https://arize.com/blog-course/r-squared-understanding-the-coefficient-of-determination/",
        "https://arize.com/blog-course/root-mean-square-error-rmse-what-you-need-to-know/",
        "https://arize.com/blog-course/ndcg/",
        "https://arize.com/blog-course/monitoring-collaborative-filtering-recsys/",
        "https://arize.com/blog-course/generative-ai-metrics-bleu-score/",
        "https://arize.com/blog-course/drift/",
        "https://arize.com/blog-course/data-binning-production/",
        "https://arize.com/blog-course/population-stability-index-psi/",
        "https://arize.com/blog-course/kl-divergence/",
        "https://arize.com/blog-course/jensen-shannon-divergence/",
        "https://arize.com/blog-course/kolmogorov-smirnov-test/",
        "https://arize.com/blog-course/algorithmic-bias-examples-tools/",
        "https://arize.com/blog-course/transparent-ethical-ai-software-systems/",
        "https://arize.com/blog-course/data-quality-management-for-mlops/",
        "https://arize.com/blog-course/service-monitoring-metrics/",
        "https://arize.com/blog-course/ml-service-level-performance-monitoring/",
        "https://arize.com/blog-course/explainability-xai-primer/",
        "https://arize.com/blog-course/explainability-techniques-shap/",
        "https://arize.com/blog-course/embeddings-meaning-examples-and-how-to-compute/",
        "https://arize.com/blog-course/knn-algorithm-k-nearest-neighbor/",
        "https://arize.com/blog-course/tokenization/",
        "https://arize.com/blog-course/embedding-versioning/",
        "https://arize.com/blog-course/reduction-of-dimensionality-top-techniques/",
        "https://arize.com/blog-course/llmops-operationalizing-llms-at-scale/",
        "https://arize.com/blog-course/embedding-drift-euclidean-distance/",
        "https://arize.com/blog-course/unleashing-bert-transformer-model-nlp/",
        "https://arize.com/blog-course/langchain-llm-agent-monitoring/",
        "https://arize.com/blog-course/evals-openai-simplifying-llm-evaluation/",
        "https://arize.com/blog-course/assessing-large-language-models/",
        "https://courses.arize.com/p/agents-tools-and-chains",
        "https://courses.arize.com/p/llm-evaluations",
        "https://courses.arize.com/p/llm-observability-traces-spans",
        "https://arize.com/ml-observability-fundamentals/",
        "https://courses.arize.com/p/ml-observability-advanced-metrics-course",
        "https://docs.arize.com/arize/quickstart",
        "https://arize.com/author/aparna-dhinakaran/",
        "https://arize.com/resource/survey-machine-learning-observability-results/",
        "https://arize.com/blog/best-practices-in-ml-observability-for-monitoring-mitigating-and-preventing-fraud/",
        "https://arize.com/ml-observability/",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning#what-is-observability",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning#types-of-observability",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning#infrastructure-observability",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning#data-observability",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning#machine-learning-observability",
        "https://arize.com/blog-course/what-is-observability-data-machine-learning/#blog-subscribe-modal",
        "https://arize.com/elearning/",
        "https://arize.com/blog-course/llm-evaluation-the-definitive-guide/",
        "https://docs.arize.com/phoenix/tracing/llm-traces",
        "https://arize.com/blog-course/rag-evaluation/",
        "https://app.arize.com/auth/login",
        "https://arize.com/contact/",
        "https://arize.com/privacy-policy/",
        "https://github.com/Arize-ai/phoenix",
        "https://www.bigeye.com/",
        "https://arize-ai.slack.com/",
        "https://twitter.com/arizeai?lang=en",
        "https://www.linkedin.com/company/arizeai/"
    ]
}