{
    "id": "ff68c9644d58ae4d6ed59dbf38ec1bef",
    "metadata": {
        "id": "ff68c9644d58ae4d6ed59dbf38ec1bef",
        "url": "https://openai.com/index/clip/",
        "title": "CLIP: Connecting text and images | OpenAI",
        "properties": {
            "description": "We’re introducing a neural network called CLIP which efficiently learns visual concepts from natural language supervision. CLIP can be applied to any visual classification benchmark by simply providing the names of the visual categories to be recognized, similar to the “zero-shot” capabilities of GPT-2 and GPT-3.",
            "keywords": null,
            "author": null,
            "og:title": "CLIP: Connecting text and images",
            "og:description": "We’re introducing a neural network called CLIP which efficiently learns visual concepts from natural language supervision. CLIP can be applied to any visual classification benchmark by simply providing the names of the visual categories to be recognized, similar to the “zero-shot” capabilities of GPT-2 and GPT-3.",
            "og:locale": "en-US",
            "og:image": "https://images.ctfassets.net/kftzwdyauwt9/5e490f66-703f-4228-221ca64049ed/8ed4358ba4b9f8779e07a2b15d7256e1/image_125.png?w=1600&h=900&fit=fill",
            "og:image:width": "1600",
            "og:image:height": "900",
            "og:image:alt": "CLIP",
            "og:type": "website",
            "twitter:card": "summary_large_image",
            "twitter:site": "@OpenAI",
            "twitter:title": "CLIP: Connecting text and images",
            "twitter:description": "We’re introducing a neural network called CLIP which efficiently learns visual concepts from natural language supervision. CLIP can be applied to any visual classification benchmark by simply providing the names of the visual categories to be recognized, similar to the “zero-shot” capabilities of GPT-2 and GPT-3.",
            "twitter:image": "https://images.ctfassets.net/kftzwdyauwt9/5e490f66-703f-4228-221ca64049ed/8ed4358ba4b9f8779e07a2b15d7256e1/image_125.png?w=1600&h=900&fit=fill",
            "twitter:image:width": "1600",
            "twitter:image:height": "900",
            "twitter:image:alt": "A grid of images with stacked duplicates of the images, emulating a 3D effect."
        }
    },
    "parent_metadata": {
        "id": "8b5b8cc1bb0f7b4a577f864c2a011c7c",
        "url": "https://www.notion.so/Multimodal-LLMs-Text-Image-8b5b8cc1bb0f7b4a577f864c2a011c7c",
        "title": "Multimodal LLMs: Text & Image",
        "properties": {
            "Type": "Leaf"
        }
    },
    "content": "[Skip to main content](#main)\n\n[](/)\n\n  * Research\n  * Products\n  * [Safety](/safety/)\n  * Company\n\n\n\nCLIP: Connecting text and images | OpenAI\n\n  * [Background and related work](#background-and-related-work)\n  * [Approach](#approach)\n  * [Key takeaways](#key-takeaways)\n  * [Limitations](#limitations)\n  * [Broader impacts](#broader-impacts)\n  * [Conclusion](#conclusion)\n\n\n\nJanuary 5, 2021\n\n# CLIP: Connecting text and images\n\n[Read paper(opens in a new window)](https://arxiv.org/abs/2103.00020)[View code(opens in a new window)](https://github.com/openai/CLIP)\n\n![CLIP](https://images.ctfassets.net/kftzwdyauwt9/5e490f66-703f-4228-221ca64049ed/8ed4358ba4b9f8779e07a2b15d7256e1/image_125.png?w=3840&q=90&fm=webp)\n\nIllustration: Justin Jay Wang\n\nWe’re introducing a neural network called CLIP which efficiently learns visual concepts from natural language supervision. CLIP can be applied to any visual classification benchmark by simply providing the names of the visual categories to be recognized, similar to the “zero-shot” capabilities of GPT-2 and GPT-3.\n\nAlthough deep learning has revolutionized computer vision, current approaches have several major problems: typical vision datasets are labor intensive and costly to create while teaching only a narrow set of visual concepts; standard vision models are good at one task and one task only, and require significant effort to adapt to a new task; and models that perform well on benchmarks have disappointingly poor performance on stress tests,[1](#citation-bottom-1), [2](#citation-bottom-2), [3](#citation-bottom-3), [4](#citation-bottom-4) casting doubt on the entire deep learning approach to computer vision.\n\nWe present a neural network that aims to address these problems: it is trained on a wide variety of images with a wide variety of natural language supervision that’s abundantly available on the internet. By design, the network can be instructed in natural language to perform a great variety of classification benchmarks, without directly optimizing for the benchmark’s performance, similar to the “” capabilities of GPT-2[5](#citation-bottom-5) and GPT-3.[6](#citation-bottom-6) This is a key change: by not directly optimizing for the benchmark, we show that it becomes much more representative: our system closes this “robustness gap” by up to 75% while matching the performance of the original ResNet-50[7](#citation-bottom-7) on  zero-shot without using any of the original 1.28M labeled examples.\n\nLoading...\n\n## Background and related work\n\nCLIP (_Contrastive Language–Image Pre-training_) builds on a large body of work on zero-shot transfer, natural language supervision, and multimodal learning. The idea of zero-data learning dates back over a decade[8](#citation-bottom-8) but until recently was mostly studied in computer vision as a way of generalizing to unseen object categories.[9](#citation-bottom-9), [10](#citation-bottom-10) A critical insight was to leverage natural language as a flexible prediction space to enable generalization and transfer. In 2013, Richard Socher and co-authors at Stanford[11](#citation-bottom-11) developed a proof of concept by training a model on CIFAR-10 to make predictions in a word vector embedding space and showed this model could predict two unseen classes. The same year DeVISE[12](#citation-bottom-12) scaled this approach and demonstrated that it was possible to fine-tune an ImageNet model so that it could generalize to correctly predicting objects outside the original 1000 training set.\n\nMost inspirational for CLIP is the work of Ang Li and his co-authors at FAIR[13](#citation-bottom-13) who in 2016 demonstrated using natural language supervision to enable zero-shot transfer to several existing computer vision classification datasets, such as the canonical ImageNet dataset. They achieved this by fine-tuning an ImageNet CNN to predict a much wider set of visual concepts (visual n-grams) from the text of titles, descriptions, and tags of 30 million Flickr photos and were able to reach 11.5% accuracy on ImageNet zero-shot.\n\nFinally, CLIP is part of a group of papers revisiting learning visual representations from natural language supervision in the past year. This line of work uses more modern architectures like the Transformer[32](#citation-bottom-32) and includes VirTex,[33](#citation-bottom-33) which explored autoregressive language modeling, ICMLM,[34](#citation-bottom-34) which investigated masked language modeling, and ConVIRT,[35](#citation-bottom-35) which studied the same contrastive objective we use for CLIP but in the field of medical imaging.\n\n## Approach\n\nWe show that scaling a simple pre-training task is sufficient to achieve competitive zero-shot performance on a great variety of image classification datasets. Our method uses an abundantly available source of supervision: the text paired with images found across the internet. This data is used to create the following proxy training task for CLIP: given an image, predict which out of a set of 32,768 randomly sampled text snippets, was actually paired with it in our dataset.\n\nIn order to solve this task, our intuition is that CLIP models will need to learn to recognize a wide variety of visual concepts in images and associate them with their names. As a result, CLIP models can then be applied to nearly arbitrary visual classification tasks. For instance, if the task of a dataset is classifying photos of dogs vs cats we check for each image whether a CLIP model predicts the text description “a photo of a  _dog_ ” or “a photo of a  _cat_ ” is more likely to be paired with it.\n\nLoading...\n\nCLIP was designed to mitigate a number of major problems in the standard deep learning approach to computer vision:\n\n**Costly datasets** : Deep learning needs a lot of data, and vision models have traditionally been trained on manually labeled datasets that are expensive to construct and only provide supervision for a limited number of predetermined visual concepts. The ImageNet dataset, one of the largest efforts in this space, required over 25,000 workers to annotate 14 million images for 22,000 object categories. In contrast, CLIP learns from text–image pairs that are already publicly available on the internet. Reducing the need for expensive large labeled datasets has been extensively studied by prior work, notably self-supervised learning,[14](#citation-bottom-14), [15](#citation-bottom-15), [16](#citation-bottom-16) contrastive methods,[17](#citation-bottom-17), [18](#citation-bottom-18), [19](#citation-bottom-19), [20](#citation-bottom-20), [21](#citation-bottom-21) self-training approaches,[22](#citation-bottom-22), [23](#citation-bottom-23) and generative modeling.[24](#citation-bottom-24), [25](#citation-bottom-25), [26](#citation-bottom-26), [27](#citation-bottom-27)\n\n**Narrow** : An ImageNet model is good at predicting the 1000 ImageNet categories, but that’s all it can do “out of the box.” If we wish to perform any other task, an ML practitioner needs to build a new dataset, add an output head, and fine-tune the model. In contrast, CLIP can be adapted to perform a wide variety of visual classification tasks without needing additional training examples. To apply CLIP to a new task, all we need to do is “tell” CLIP’s text-encoder the names of the task’s visual concepts, and it will output a linear classifier of CLIP’s visual representations. The accuracy of this classifier is often competitive with fully supervised models.\n\nWe show random, non-cherry picked, predictions of zero-shot CLIP classifiers on examples from various datasets below.\n\nLoading...\n\n**Poor real-world performance** : Deep learning systems are often reported to achieve human or even superhuman performance[28](#citation-bottom-28), [A](#citation-bottom-A) on vision benchmarks, yet when deployed in the wild, their performance can be far below the expectation set by the benchmark. In other words, there is a gap between “benchmark performance” and “real performance.” We conjecture that this gap occurs because the models “cheat” by only optimizing for performance on the benchmark, much like a student who passed an exam by studying only the questions on past years’ exams. In contrast, the CLIP model can be evaluated on benchmarks without having to train on their data, so it can’t “cheat” in this manner. This results in its benchmark performance being much more representative of its performance in the wild. To verify the “cheating hypothesis”, we also measure how CLIP’s performance changes when it is able to “study” for ImageNet. When a linear classifier is fitted on top of CLIP’s features, it improves CLIP’s accuracy on the ImageNet test set by almost 10%. However, this classifier does  _no better_ on average across an evaluation suite of 7 other datasets measuring “robust” performance.[30](#citation-bottom-30)\n\n## Key takeaways\n\n**1. CLIP is highly efficient**\n\nCLIP learns from unfiltered, highly varied, and highly noisy data, and is intended to be used in a zero-shot manner. We know from GPT-2 and 3 that models trained on such data can achieve compelling zero shot performance; however, such models require significant training compute. To reduce the needed compute, we focused on algorithmic ways to improve the training efficiency of our approach.\n\nWe report two algorithmic choices that led to significant compute savings. The first choice is the adoption of a contrastive objective for connecting text with images.[31](#citation-bottom-31), [17](#citation-bottom-17), [35](#citation-bottom-35) We originally explored an image-to-text approach, similar to VirTex,[33](#citation-bottom-33) but encountered difficulties scaling this to achieve state-of-the-art performance. In small to medium scale experiments, we found that the contrastive objective used by CLIP is 4x to 10x more efficient at zero-shot ImageNet classification. The second choice was the adoption of the Vision Transformer,[36](#citation-bottom-36) which gave us a further 3x gain in compute efficiency over a standard ResNet. In the end, our best performing CLIP model trains on 256 GPUs for 2 weeks which is similar to existing large scale image models.[37](#citation-bottom-37), [23](#citation-bottom-23), [38](#citation-bottom-38), [36](#citation-bottom-36)\n\nLoading...\n\n**2. CLIP is flexible and general**\n\nBecause they learn a wide range of visual concepts directly from natural language, CLIP models are significantly more flexible and general than existing ImageNet models. We find they are able to zero-shot perform many different tasks. To validate this we have measured CLIP’s zero-shot performance on over 30 different datasets including tasks such as fine-grained object classification, geo-localization, action recognition in videos, and OCR.[B](#citation-bottom-B) In particular, learning OCR is an example of an exciting behavior that does not occur in standard ImageNet models. Above, we visualize a random non-cherry picked prediction from each zero-shot classifier.\n\nThis finding is also reflected on a standard representation learning evaluation using linear probes. The best CLIP model outperforms the best publicly available ImageNet model, the Noisy Student EfficientNet-L2,[23](#citation-bottom-23) on 20 out of 26 different transfer datasets we tested.\n\nLoading...\n\n## Limitations\n\nWhile CLIP usually performs well on recognizing common objects, it struggles on more abstract or systematic tasks such as counting the number of objects in an image and on more complex tasks such as predicting how close the nearest car is in a photo. On these two datasets, zero-shot CLIP is only slightly better than random guessing. Zero-shot CLIP also struggles compared to task specific models on very fine-grained classification, such as telling the difference between car models, variants of aircraft, or flower species.\n\nCLIP also still has poor generalization to images not covered in its pre-training dataset. For instance, although CLIP learns a capable OCR system, when evaluated on handwritten digits from the MNIST dataset, zero-shot CLIP only achieves 88% accuracy, well below the 99.75% of humans on the dataset. Finally, we’ve observed that CLIP’s zero-shot classifiers can be sensitive to wording or phrasing and sometimes require trial and error “prompt engineering” to perform well.\n\n## Broader impacts\n\nCLIP allows people to design their own classifiers and removes the need for task-specific training data. The manner in which these classes are designed can heavily influence both model performance and model biases. For example, we find that when given a set of labels including Fairface[39](#citation-bottom-39) race labels[C](#citation-bottom-C) and a handful of egregious terms such as “criminal”, “animal,” etc., the model tends to classify images of people aged 0–20 in the egregious category at a rate of ~32.3%. However, when we add the class “child” to the list of possible classes, this behaviour drops to ~8.7%.\n\nAdditionally, given that CLIP does not need task-specific training data it can unlock certain niche tasks with greater ease. Some of these tasks may raise privacy or surveillance related risks and we explore this concern by studying the performance of CLIP on celebrity identification. CLIP has a top-1 accuracy of 59.2% for “in the wild” celebrity image classification when choosing from 100 candidates and a top-1 accuracy of 43.3% when choosing from 1000 possible choices. Although it’s noteworthy to achieve these results with task agnostic pre-training, this performance is not competitive when compared to widely available production level models. We further explore challenges that CLIP poses in our  and we hope that this work motivates future research on the characterization of the capabilities, shortcomings, and biases of such models. We are excited to engage with the research community on such questions.\n\n## Conclusion\n\nWith CLIP, we’ve tested whether task agnostic pre-training on internet scale natural language, which has powered a recent breakthrough in NLP, can also be leveraged to improve the performance of deep learning for other fields. We are excited by the results we’ve seen so far applying this approach to computer vision. Like the GPT family, CLIP learns a wide variety of tasks during pre-training which we demonstrate via zero-shot transfer. We are also encouraged by our findings on ImageNet that suggest zero-shot evaluation is a more representative measure of a model’s capability.\n\n  * [Milestone](/news/research/?tags=research-milestone)\n  * [Publication](/news/research/?tags=research-publication)\n  * [Release](/news/research/?tags=research-release)\n  * [CLIP](/news/research/?tags=model-clip)\n  * [Computer vision](/news/research/?tags=topic-computer-vision)\n  * [Contrastive learning](/news/research/?tags=topic-contrastive-learning)\n  * [Representation learning](/news/research/?tags=topic-representation-learning)\n  * [Supervised learning](/news/research/?tags=topic-supervised-learning)\n  * [Transfer learning](/news/research/?tags=topic-transfer-learning)\n\n\n\n## Footnotes\n\n  1. 29\n\nIn 2015, a group of researchers from Microsoft first trained a model which achieved a top-5 accuracy on ImageNet that surpassed reported human top-5 accuracy.[](#citation-top-29)[](#citation-top-A)\n\n  2. B\n\nWhile CLIP’s zero-shot OCR performance is mixed, its semantic OCR representation is quite useful. When evaluated on the SST-2 NLP dataset rendered as images, a linear classifer on CLIP’s representation matches a CBoW model with direct access to the text. CLIP is also competitive at detecting hateful memes without needing ground truth text. [](#citation-top-B)\n\n  3. 40\n\nFairFace is a face image dataset designed to balance age, gender, and race, in order to reduce asymmetries common in previous face datasets. It categorizes gender into 2 groups: female and male and race into 7 groups: White, Black, Indian, East Asian, Southeast Asian, Middle Eastern, and Latino. There are inherent problems with race and gender classifications, as e.g. Bowker and Star (2000)[](#citation-top-40) and Keyes (2018)[](#citation-top-41) have shown. While FairFace’s dataset reduces the proportion of White faces, it still lacks representation of entire large demographic groups, effectively erasing such categories. We use the 2 gender categories and 7 race categories defined in the FairFace dataset in a number of our experiments not in order to reinforce or endorse the use of such reductive categories, but in order to enable us to make comparisons to prior work. [](#citation-top-C)\n\n\n\n\n## References\n\n  1. 1\n\nDodge, S., & Karam, L. (2017, July). “” In ICCCN 2017. [](#citation-top-1)\n\n  2. 2\n\nGeirhos, R., Rubisch, P., Michaelis, C., Bethge, M., Wichmann, F. A., & Brendel, W. (2018). “” In ICLR 2019. [](#citation-top-2)\n\n  3. 3\n\nAlcorn, M. A., Li, Q., Gong, Z., Wang, C., Mai, L., Ku, W. S., & Nguyen, A. (2019). “” In CVPR 2019. [](#citation-top-3)\n\n  4. 4\n\nBarbu, A., Mayo, D., Alverio, J., Luo, W., Wang, C., Gutfreund, D., ... & Katz, B. (2019). “” In NeurIPS 2019. [](#citation-top-4)\n\n  5. 5\n\nRadford, A., Wu, J., Child, R., Luan, D., Amodei, D., & Sutskever, I. (2019). “” Technical Report, OpenAI. [](#citation-top-5)\n\n  6. 6\n\nBrown, T. B., Mann, B., Ryder, N., Subbiah, M., Kaplan, J., Dhariwal, P., ... & Agarwal, S. (2020). “” In NeurIPS 2020. [](#citation-top-6)\n\n  7. 7\n\nHe, K., Zhang, X., Ren, S., & Sun, J. (2016). “” In CVPR 2016. [](#citation-top-7)\n\n  8. 8\n\nLarochelle, H., Erhan, D., & Bengio, Y. (2008, July). “” In AAAI 2008. [](#citation-top-8)\n\n  9. 9\n\nLampert, C. H., Nickisch, H., & Harmeling, S. (2009, June). “” In CVPR 2009. [](#citation-top-9)\n\n  10. 10\n\nLei Ba, J., Swersky, K., & Fidler, S. (2015). “” In ICCV 2015. [](#citation-top-10)\n\n  11. 11\n\nSocher, R., Ganjoo, M., Manning, C. D., & Ng, A. (2013). “” In NeurIPS 2013. [](#citation-top-11)\n\n  12. 12\n\nFrome, A., Corrado, G. S., Shlens, J., Bengio, S., Dean, J., Ranzato, M. A., & Mikolov, T. (2013). “” In NeurIPS 2013. [](#citation-top-12)\n\n  13. 13\n\nLi, A., Jabri, A., Joulin, A., & van der Maaten, L. (2017). “” In Proceedings of the IEEE International Conference on Computer Vision 2017. [](#citation-top-13)\n\n  14. 14\n\nDoersch, C., Gupta, A., & Efros, A. A. (2015). “” In ICCV 2015. [](#citation-top-14)\n\n  15. 15\n\nZhai, X., Oliver, A., Kolesnikov, A., & Beyer, L. (2019). “” In ICCV 2019. [](#citation-top-15)\n\n  16. 16\n\nGrill, J. B., Strub, F., Altché, F., Tallec, C., Richemond, P. H., Buchatskaya, E., ... & Piot, B. (2020). “” In NeurIPS 2020. [](#citation-top-16)\n\n  17. 17\n\nOord, A. V. D., Li, Y., & Vinyals, O. (2018). “” arXiv preprint. [](#citation-top-17)\n\n  18. 18\n\nHjelm, R. D., Fedorov, A., Lavoie-Marchildon, S., Grewal, K., Bachman, P., Trischler, A., & Bengio, Y. (2018). “” In ICLR 2019. [](#citation-top-18)\n\n  19. 19\n\nBachman, P., Hjelm, R. D., & Buchwalter, W. (2019). “” In NeurIPS 2019. [](#citation-top-19)\n\n  20. 20\n\nHe, K., Fan, H., Wu, Y., Xie, S., & Girshick, R. (2020). “” In CVPR 2020. [](#citation-top-20)\n\n  21. 21\n\nChen, T., Kornblith, S., Norouzi, M., & Hinton, G. (2020). “” arXiv preprint. [](#citation-top-21)\n\n  22. 22\n\nLee, D. H. (2013, June). “” In Workshop on challenges in representation learning, ICML (2013). [](#citation-top-22)\n\n  23. 23\n\nXie, Q., Luong, M. T., Hovy, E., & Le, Q. V. (2020). “” In CVPR 2020. [](#citation-top-23)\n\n  24. 24\n\nKingma, D. P., Mohamed, S., Jimenez Rezende, D., & Welling, M. (2014). “” In NeurIPS 2014. [](#citation-top-24)\n\n  25. 25\n\nSalimans, T., Goodfellow, I., Zaremba, W., Cheung, V., Radford, A., & Chen, X. (2016). “” In NeurIPS 2016. [](#citation-top-25)\n\n  26. 26\n\nDonahue, J., & Simonyan, K. (2019). “” In NeurIPS 2019. [](#citation-top-26)\n\n  27. 27\n\nChen, M., Radford, A., Child, R., Wu, J., Jun, H., Luan, D., & Sutskever, I. (2020, November). “” In ICML 2020. [](#citation-top-27)\n\n  28. 28\n\nHe, K., Zhang, X., Ren, S., & Sun, J. (2015). “” In ICCV 2015. [](#citation-top-28)\n\n  29. 29\n\nRussakovsky, O., Deng, J., Su, H., Krause, J., Satheesh, S., Ma, S., ... & Berg, A. C. (2015). “” In IJCV 2015. [](#citation-top-29)\n\n  30. 30\n\nTaori, R., Dave, A., Shankar, V., Carlini, N., Recht, B., & Schmidt, L. (2020). “” In NeurIPS 2020. [](#citation-top-30)\n\n  31. 31\n\nSohn, K. (2016). “” In NeurIPS 2016. [](#citation-top-31)\n\n  32. 32\n\nVaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., ... & Polosukhin, I. (2017). “” In NeurIPS 2017. [](#citation-top-32)\n\n  33. 33\n\nDesai, K., & Johnson, J. (2020). “” arXiv preprint. [](#citation-top-33)\n\n  34. 34\n\nSariyildiz, M. B., Perez, J., & Larlus, D. (2020). “” In ECCV 2020. [](#citation-top-34)\n\n  35. 35\n\nZhang, Y., Jiang, H., Miura, Y., Manning, C. D., & Langlotz, C. P. (2020). “” arXiv preprint. [](#citation-top-35)\n\n  36. 36\n\nDosovitskiy, A., Beyer, L., Kolesnikov, A., Weissenborn, D., Zhai, X., Unterthiner, T., ... & Uszkoreit, J. (2020). “” arXiv preprint. [](#citation-top-36)\n\n  37. 37\n\nMahajan, D., Girshick, R., Ramanathan, V., He, K., Paluri, M., Li, Y., ... & van der Maaten, L. (2018). “” In ECCV 2018. [](#citation-top-37)\n\n  38. 38\n\nKolesnikov, A., Beyer, L., Zhai, X., Puigcerver, J., Yung, J., Gelly, S., & Houlsby, N. (2019). “” arXiv preprint. [](#citation-top-38)\n\n  39. 39\n\nKärkkäinen, K., & Joo, J. (2019). “” arXiv preprint. [](#citation-top-39)\n\n  40. 40\n\nBowker, G., & Star, S. L. (1999). “” Book. [](#citation-top-40)\n\n  41. 41\n\nKeyes, O. (2018). “” In Proceedings of the ACM on Human-Computer Interaction. [](#citation-top-41)\n\n\n\n\n## Authors\n\n[Alec Radford](/news/?author=alec-radford#results), [Ilya Sutskever](/news/?author=ilya-sutskever#results), [Jong Wook Kim](/news/?author=jong-wook-kim#results), [Gretchen Krueger](/news/?author=gretchen-krueger#results), [Sandhini Agarwal](/news/?author=sandhini-agarwal#results)\n\n## Acknowledgments\n\nWe’d like to thank the millions of people involved in creating the data CLIP is trained on. We also are grateful to all our co-authors for their contributions to the project. Finally, we’d like to thank Jeff Clune, Miles Brundage, Ryan Lowe, Jakub Pachocki, and Vedant Misra for feedback on drafts of this blog and Matthew Knight for reviewing the code release.\n\n## Design & Cover Artwork\n\nJustin Jay Wang\n\n## Related articles\n\n[View all research articles](/news/research/)\n\n[Dec 16, 2022Dec 16, 2022Dec 16, 2022Point-E: A system for generating 3D point clouds from complex promptsPoint-E: A system for generating 3D point clouds from complex promptsPoint-E: A system for generating 3D point clouds from complex prompts![Point E A System For Generating 3d Point Clouds From Complex Prompts](https://images.ctfassets.net/kftzwdyauwt9/7e4ba260-7655-4049-5a2568c94158/2f2af956a356ee2b507296d01e45e766/image-5.webp?w=3840&q=90&fm=webp)](/index/point-e/)\n\n[Jun 23, 2022Jun 23, 2022Jun 23, 2022Learning to play Minecraft with Video PreTrainingLearning to play Minecraft with Video PreTrainingLearning to play Minecraft with Video PreTraining![Screenshot of a scene from Minecraft](https://images.ctfassets.net/kftzwdyauwt9/ef9fc360-1a5a-4ca3-5c25b83b3564/50c07940455cc86ef84d91526d9cf3e0/vpt.jpg?w=3840&q=90&fm=webp)](/index/vpt/)\n\n[Apr 13, 2022Apr 13, 2022Apr 13, 2022Hierarchical text-conditional image generation with CLIP latentsHierarchical text-conditional image generation with CLIP latentsHierarchical text-conditional image generation with CLIP latents![Hierarchical Text Conditional Image Generation With Clip Latents](https://images.ctfassets.net/kftzwdyauwt9/7c44eedc-3563-4438-c613706c52b1/fcfc38b26fd4878a3c6b4ca8d1d73b17/hierarchical-text-conditional-image-generation-with-clip-latents.jpg?w=3840&q=90&fm=webp)](/index/hierarchical-text-conditional-image-generation-with-clip-latents/)\n\nOur research\n\n  * [Overview](/research/)\n  * [Index](/news/research/)\n\n\n\nLatest advancements\n\n  * [OpenAI o1](/index/learning-to-reason-with-llms/)\n  * [OpenAI o1-mini](/index/openai-o1-mini-advancing-cost-efficient-reasoning/)\n  * [GPT-4](/index/gpt-4/)\n  * [GPT-4o mini](/index/gpt-4o-mini-advancing-cost-efficient-intelligence/)\n  * [DALL·E 3](/index/dall-e-3/)\n  * [Sora](/index/sora/)\n\n\n\nChatGPT\n\n  * [For Everyone](/chatgpt/overview/)\n  * [For Teams](/chatgpt/team/)\n  * [For Enterprises](/chatgpt/enterprise/)\n  * [ChatGPT login(opens in a new window)](https://chatgpt.com/)\n  * [Download](/chatgpt/download/)\n\n\n\nAPI\n\n  * [Platform overview](/api/)\n  * [Pricing](/api/pricing/)\n  * [Documentation(opens in a new window)](https://platform.openai.com/docs/introduction)\n  * [API login(opens in a new window)](https://platform.openai.com/)\n\n\n\nExplore more\n\n  * [OpenAI for business](/business/)\n  * [Stories](/news/stories/)\n\n\n\nSafety overview\n\n  * [Safety overview](/safety/)\n\n\n\nCompany\n\n  * [About us](/about/)\n  * [News](/news/)\n  * [Our Charter](/charter/)\n  * [Security](/security-and-privacy/)\n  * [Residency](/residency/)\n  * [Careers](/careers/)\n\n\n\nTerms & policies\n\n  * [Terms of use](/policies/terms-of-use/)\n  * [Privacy policy](/policies/privacy-policy/)\n  * [Brand guidelines](/brand/)\n  * [Other policies ](/policies/)\n\n\n\nOpenAI © 2015–2025Manage Cookies\n\n[(opens in a new window)](https://x.com/OpenAI)[(opens in a new window)](https://www.youtube.com/OpenAI)[(opens in a new window)](https://www.linkedin.com/company/openai)[(opens in a new window)](https://github.com/openai)[(opens in a new window)](https://www.instagram.com/openai/?hl=en)[(opens in a new window)](https://www.tiktok.com/@openai?lang=en)[(opens in a new window)](https://discord.gg/openai)\n\nWe use cookies and similar technologies to deliver, maintain, improve our services and for security purposes.\n\nCheck our [Cookie Policy](/policies/cookie-policy/) for details. Click 'Accept all' to let OpenAI and partners use cookies for these purposes. Click 'Reject non-essential' to say no to cookies, except those that are strictly necessary.\n\nAccept allReject non-essential\n",
    "content_quality_score": 1.0,
    "summary": null,
    "child_urls": [
        "https://openai.com/index/clip/#main",
        "https://openai.com/",
        "https://openai.com/safety/",
        "https://openai.com/index/clip/#background-and-related-work",
        "https://openai.com/index/clip/#approach",
        "https://openai.com/index/clip/#key-takeaways",
        "https://openai.com/index/clip/#limitations",
        "https://openai.com/index/clip/#broader-impacts",
        "https://openai.com/index/clip/#conclusion",
        "https://openai.com/index/clip/#citation-bottom-1",
        "https://openai.com/index/clip/#citation-bottom-2",
        "https://openai.com/index/clip/#citation-bottom-3",
        "https://openai.com/index/clip/#citation-bottom-4",
        "https://openai.com/index/clip/#citation-bottom-5",
        "https://openai.com/index/clip/#citation-bottom-6",
        "https://openai.com/index/clip/#citation-bottom-7",
        "https://openai.com/index/clip/#citation-bottom-8",
        "https://openai.com/index/clip/#citation-bottom-9",
        "https://openai.com/index/clip/#citation-bottom-10",
        "https://openai.com/index/clip/#citation-bottom-11",
        "https://openai.com/index/clip/#citation-bottom-12",
        "https://openai.com/index/clip/#citation-bottom-13",
        "https://openai.com/index/clip/#citation-bottom-32",
        "https://openai.com/index/clip/#citation-bottom-33",
        "https://openai.com/index/clip/#citation-bottom-34",
        "https://openai.com/index/clip/#citation-bottom-35",
        "https://openai.com/index/clip/#citation-bottom-14",
        "https://openai.com/index/clip/#citation-bottom-15",
        "https://openai.com/index/clip/#citation-bottom-16",
        "https://openai.com/index/clip/#citation-bottom-17",
        "https://openai.com/index/clip/#citation-bottom-18",
        "https://openai.com/index/clip/#citation-bottom-19",
        "https://openai.com/index/clip/#citation-bottom-20",
        "https://openai.com/index/clip/#citation-bottom-21",
        "https://openai.com/index/clip/#citation-bottom-22",
        "https://openai.com/index/clip/#citation-bottom-23",
        "https://openai.com/index/clip/#citation-bottom-24",
        "https://openai.com/index/clip/#citation-bottom-25",
        "https://openai.com/index/clip/#citation-bottom-26",
        "https://openai.com/index/clip/#citation-bottom-27",
        "https://openai.com/index/clip/#citation-bottom-28",
        "https://openai.com/index/clip/#citation-bottom-A",
        "https://openai.com/index/clip/#citation-bottom-30",
        "https://openai.com/index/clip/#citation-bottom-31",
        "https://openai.com/index/clip/#citation-bottom-36",
        "https://openai.com/index/clip/#citation-bottom-37",
        "https://openai.com/index/clip/#citation-bottom-38",
        "https://openai.com/index/clip/#citation-bottom-B",
        "https://openai.com/index/clip/#citation-bottom-39",
        "https://openai.com/index/clip/#citation-bottom-C",
        "https://openai.com/news/research/?tags=research-milestone",
        "https://openai.com/news/research/?tags=research-publication",
        "https://openai.com/news/research/?tags=research-release",
        "https://openai.com/news/research/?tags=model-clip",
        "https://openai.com/news/research/?tags=topic-computer-vision",
        "https://openai.com/news/research/?tags=topic-contrastive-learning",
        "https://openai.com/news/research/?tags=topic-representation-learning",
        "https://openai.com/news/research/?tags=topic-supervised-learning",
        "https://openai.com/news/research/?tags=topic-transfer-learning",
        "https://openai.com/index/clip/#citation-top-29",
        "https://openai.com/index/clip/#citation-top-A",
        "https://openai.com/index/clip/#citation-top-B",
        "https://openai.com/index/clip/#citation-top-40",
        "https://openai.com/index/clip/#citation-top-41",
        "https://openai.com/index/clip/#citation-top-C",
        "https://openai.com/index/clip/#citation-top-1",
        "https://openai.com/index/clip/#citation-top-2",
        "https://openai.com/index/clip/#citation-top-3",
        "https://openai.com/index/clip/#citation-top-4",
        "https://openai.com/index/clip/#citation-top-5",
        "https://openai.com/index/clip/#citation-top-6",
        "https://openai.com/index/clip/#citation-top-7",
        "https://openai.com/index/clip/#citation-top-8",
        "https://openai.com/index/clip/#citation-top-9",
        "https://openai.com/index/clip/#citation-top-10",
        "https://openai.com/index/clip/#citation-top-11",
        "https://openai.com/index/clip/#citation-top-12",
        "https://openai.com/index/clip/#citation-top-13",
        "https://openai.com/index/clip/#citation-top-14",
        "https://openai.com/index/clip/#citation-top-15",
        "https://openai.com/index/clip/#citation-top-16",
        "https://openai.com/index/clip/#citation-top-17",
        "https://openai.com/index/clip/#citation-top-18",
        "https://openai.com/index/clip/#citation-top-19",
        "https://openai.com/index/clip/#citation-top-20",
        "https://openai.com/index/clip/#citation-top-21",
        "https://openai.com/index/clip/#citation-top-22",
        "https://openai.com/index/clip/#citation-top-23",
        "https://openai.com/index/clip/#citation-top-24",
        "https://openai.com/index/clip/#citation-top-25",
        "https://openai.com/index/clip/#citation-top-26",
        "https://openai.com/index/clip/#citation-top-27",
        "https://openai.com/index/clip/#citation-top-28",
        "https://openai.com/index/clip/#citation-top-30",
        "https://openai.com/index/clip/#citation-top-31",
        "https://openai.com/index/clip/#citation-top-32",
        "https://openai.com/index/clip/#citation-top-33",
        "https://openai.com/index/clip/#citation-top-34",
        "https://openai.com/index/clip/#citation-top-35",
        "https://openai.com/index/clip/#citation-top-36",
        "https://openai.com/index/clip/#citation-top-37",
        "https://openai.com/index/clip/#citation-top-38",
        "https://openai.com/index/clip/#citation-top-39",
        "https://openai.com/news/?author=alec-radford#results",
        "https://openai.com/news/?author=ilya-sutskever#results",
        "https://openai.com/news/?author=jong-wook-kim#results",
        "https://openai.com/news/?author=gretchen-krueger#results",
        "https://openai.com/news/?author=sandhini-agarwal#results",
        "https://openai.com/news/research/",
        "https://openai.com/index/point-e/",
        "https://openai.com/index/vpt/",
        "https://openai.com/index/hierarchical-text-conditional-image-generation-with-clip-latents/",
        "https://openai.com/research/",
        "https://openai.com/index/learning-to-reason-with-llms/",
        "https://openai.com/index/openai-o1-mini-advancing-cost-efficient-reasoning/",
        "https://openai.com/index/gpt-4/",
        "https://openai.com/index/gpt-4o-mini-advancing-cost-efficient-intelligence/",
        "https://openai.com/index/dall-e-3/",
        "https://openai.com/index/sora/",
        "https://openai.com/chatgpt/overview/",
        "https://openai.com/chatgpt/team/",
        "https://openai.com/chatgpt/enterprise/",
        "https://openai.com/chatgpt/download/",
        "https://openai.com/api/",
        "https://openai.com/api/pricing/",
        "https://platform.openai.com/docs/introduction",
        "https://platform.openai.com/",
        "https://openai.com/business/",
        "https://openai.com/news/stories/",
        "https://openai.com/about/",
        "https://openai.com/news/",
        "https://openai.com/charter/",
        "https://openai.com/security-and-privacy/",
        "https://openai.com/residency/",
        "https://openai.com/careers/",
        "https://openai.com/policies/terms-of-use/",
        "https://openai.com/policies/privacy-policy/",
        "https://openai.com/brand/",
        "https://openai.com/policies/",
        "https://openai.com/policies/cookie-policy/",
        "https://arxiv.org/abs/2103.00020",
        "https://github.com/openai/CLIP",
        "https://chatgpt.com/",
        "https://x.com/OpenAI",
        "https://www.youtube.com/OpenAI",
        "https://www.linkedin.com/company/openai",
        "https://github.com/openai",
        "https://www.instagram.com/openai/?hl=en",
        "https://www.tiktok.com/@openai?lang=en",
        "https://discord.gg/openai"
    ]
}