{
    "id": "b2c5ccb476f0aebd8eb1525ee3f7b2bc",
    "metadata": {
        "id": "b2c5ccb476f0aebd8eb1525ee3f7b2bc",
        "url": "https://www.notion.so/Components-Architecture-and-System-Design-b2c5ccb476f0aebd8eb1525ee3f7b2bc",
        "title": "Components, Architecture, and System Design",
        "properties": {
            "Type": "Leaf"
        }
    },
    "parent_metadata": {
        "id": "0ab16b2a81e0e4a4b3b6c9d2711287ad",
        "url": "",
        "title": "",
        "properties": {}
    },
    "content": "# Notes\n\n\n\n<child_page>\n# ML Pipeline Architecture Design Patterns (With 10 Real-World Examples)\n\n[https://neptune.ai/blog/ml-pipeline-architecture-design-patterns](https://neptune.ai/blog/ml-pipeline-architecture-design-patterns)\n\n# Summary\n\nThis article explores ML pipeline architecture design patterns, highlighting the distinction between ML pipeline architecture and design. It emphasizes the importance of following these patterns for efficiency, scalability, reproducibility, and standardization. The article outlines key stages in ML pipelines, including data ingestion, preprocessing, feature engineering, model training, evaluation, deployment, and monitoring. It then delves into 10 ML pipeline architecture examples, such as single leader architecture, directed acyclic graphs (DAGs), foreach pattern, synchronous training, parameter server architecture, and Ring-AllReduce architecture. Each pattern is explained with its advantages, disadvantages, and real-world applications, providing a comprehensive overview of ML pipeline architectures in practice.\n---\n\n# Details\n\n Two terms are often used interchangeably, yet they hold distinct meanings.\n- ML pipeline architecture is like the high-level musical score for the symphony. It outlines the components, stages, and workflows within the ML pipeline.\n- In contrast, ML pipeline design is a deep dive into the composition of the ML pipeline, dealing with the tools, paradigms, techniques, and programming languages used to implement the pipeline and its components.\n\nFour reasons for following ML pipeline architecture and designs:\n- Efficiency\n- Scalability\n- Templating and reproducibility\n- Standardization\n\nMLOps: monitoring, maintaining, and deployment stages\n\nMain stages within ML pipelines:\n- Data Ingestion (e.g., Apache Kafka, Amazon Kinesis)\n- Data Preprocessing (e.g., pandas, NumPy)\n- Feature Engineering and Selection (e.g., Scikit-learn, Feature Tools)\n- Model Training (e.g., TensorFlow, PyTorch)\n- Model Evaluation (e.g., Scikit-learn, MLflow)\n- Model Deployment (e.g., TensorFlow Serving, TFX)\n- Monitoring and Maintenance (e.g., Prometheus, Grafana)\n# 10 ML pipeline architecture examples\n\n# Single leader architecture\n\n- Master-slave architecture\n- Pros: Scale horizontally for read operations\n- Cons: Scale vertically for write operations\n\n# Directed acyclic graphs (DAG)\n\nDirected graphs are made up of nodes, edges, and directions. The nodes represent processes; edges in graphs depict relationships between processes, and the direction of the edges signifies the flow of process execution or data/signal transfer within the graph.\nFor instance, a condition in graphs where loops between vertices or nodes are disallowed. This type of graph is called an acyclic graph\nDAGs can easily be sorted topologically.\nUsing DAGs provides an efficient way to execute processes and tasks in various applications, including big data analytics, machine learning, and artificial intelligence, where task dependencies and the order of execution are crucial.\nIn modern machine learning pipelines that are expected to be adaptable and operate within dynamic environments or workflows, DAGs are unsuitable for modelling and managing these systems or pipelines, primarily because DAGs are ideal for static workflows with predefined dependencies. \n# Foreach pattern\n\nThe foreach pattern is a code execution paradigm that iteratively executes a piece of code for the number of times an item appears within a collection or set of data.\nFor example, the foreach pattern can be used in the model training stage of ML pipelines, where a model is repeatedly exposed to different partitions of the dataset for training and others for testing over a specified amount of time.\n[Image](No URL)\n\n\nUtilizing the DAG architecture and foreach pattern in an ML pipeline enables a robust, scalable, and manageable ML pipeline solution. \nBelow is an illustration of an ML pipeline leveraging DAG and foreach pattern. The flowchart represents a machine learning pipeline where each stage (Data Collection, Data Preprocessing, Feature Extraction, Model Training, Model Validation, and Prediction Generation) is represented as a Directed Acyclic Graph (DAG) node. Within each stage, the “foreach” pattern is used to apply a specific operation to each item in a collection:\n[Image](No URL)\nBut there are some disadvantages to it as well.\nWhen utilizing the foreach pattern in data or feature processing stages, all data must be loaded into memory before the operations can be executed. This can lead to poor computational performance, mainly when processing large volumes of data that may exceed available memory resources. For instance, in a use-case where the dataset is several terabytes large, the system may run out of memory, slow down, or even crash if it attempts to load all the data simultaneously.\nAnother limitation of the foreach pattern lies in the execution order of elements within a data collection. The foreach pattern does not guarantee a consistent order of execution or order in the same form the data was loaded. Inconsistent order of execution within foreach patterns can be problematic in scenarios where the sequence in which data or features are processed is significant (e.g., time-series)\n# Synchronous training\n\nIn this context, synchronous training involves a coordinated effort among all independent computational units, referred to as ‘workers’. Each worker holds a partition of the model and updates its parameters using its portion of the evenly distributed data. \n[Image](No URL)\n\nSynchronous Training is relevant to scenarios or use cases where there is a need for even distribution of training data across compute resources, uniform computational capacity across all resources, and low latency communication between these independent resources. \nCompared to asynchronous methods, synchronous training often achieves superior results as workers’ synchronized and uniform operation reduces variance in parameter updates at each step.\nSynchronous training may pose time efficiency issues as it requires the completion of tasks by all workers before proceeding to the next step. \n# Parameter server architecture\n\nThis architecture operates on the principle of server-client relationships, where the client nodes, referred to as ‘workers’, are assigned specific tasks such as handling data, managing model partitions, and executing defined operations.\nOn the other hand, the server node plays a central role in managing and aggregating the updated model parameters and is also responsible for communicating these updates to the client nodes.\n[Image](No URL)\n# Ring-AllReduce architecture\n\nThe workers independently compute their gradients during backward propagation on their own partition of the training data. A ring-like structure is applied to ensure each worker on a device has a model with parameters that include the gradient updates made on all other independent workers.\nhis is achieved by passing the sum of gradients from one worker to the next worker in the ring, which then adds its own computed gradient to the sum and passes it on to the following worker. This process is repeated until all the workers have the complete sum of the gradients aggregated from all workers in the ring.\n[Image](No URL)\nReal-world applications involving distributed machine learning training, particularly in scenarios requiring handling extensive datasets (e.g., Meta, Google)\n\n- It enables effective data parallelism by ensuring optimal utilization of computational resources. Each worker node holds a complete copy of the model and is responsible for training on its subset of the data. \n- Another advantage of Ring-AllReduce is that it allows for the aggregation of model parameter updates across multiple devices.\n# Others\n\n- Embeddings\n- Data parallelism\n- Model parallelism\n- Federated learning\n</child_page>\n\n\n\n<child_page>\n# Natural workflow of an ML system: from model development to ops\n\n[https://nicolay-gerold.notion.site/Season-3-MLOps-How-AI-Is-Built-2be82e4d93604c0594d84475f0a77721](https://nicolay-gerold.notion.site/Season-3-MLOps-How-AI-Is-Built-2be82e4d93604c0594d84475f0a77721)\n---\n\n# 1. Model Development: Building the Porcelain\n\n# Data Automation\n\n- Implementing automated processes for data collection, cleaning, and preparation\n- Ensuring data quality and consistency through automated pipelines\n# Data Quality and Validation\n\n- Implementing Data Quality Gates and Automated Data Quality Monitoring\n- Designing Data Validation Systems That Scale\n- Utilizing tools like Great Expectations and Pydantic for data validation\n# Version Control for Data\n\n- Implementing Git-Like Operations for Data\n- Data Version Control with lakeFS: A Practical Guide\n- Managing Dataset Evolution in Production\n# Experiment Management and Reproducibility\n\n- Building a Reproducible ML Pipeline with tools like Weights & Biases (W&B) or Comet\n- From Prototype to Production: Effective Experiment Management\n- Scaling ML Experiments: Infrastructure and Best Practices\n# Model Validation and Testing\n\n- Beyond Accuracy: Comprehensive Model Validation Strategies\n- Building Model Validation Pipelines That Scale\n- Testing Model Behavior: From Unit Tests to Integration\n# 2. Deployment & Serving\n\n# Security and Abuse Prevention\n\n- Preventing abuse of customer-facing ML & AI Systems\n- Implementing access controls and monitoring for potential misuse\n# Batch Processing Optimization\n\n- Maximizing throughput for batch workloads\n- Best practices for efficient batch processing in ML systems\n# Gradual Rollout and Testing\n\n- Canary Testing for ML: Implementing gradual rollouts and monitoring performance\n- A/B Testing for ML: Designing and executing controlled experiments to compare model versions\n# Continuous Integration and Deployment (CI/CD)\n\n- Implementing CI/CD pipelines specifically for ML workflows\n- Automating model deployment and updates\n# Model Lifecycle Management\n\n- Strategies for managing the entire lifecycle of ML models\n- Version control, monitoring, and updating models in production\n# Model Serving Patterns\n\n- Comparing Model Serving Patterns: Batch, Real-Time, Micro-Batch, Edge\n- Infrastructure Choices: Self-Hosted, Cloud Services, Edge/Browser\n# Distributed Inference\n\n- Techniques for distributed inference across various model types (LLMs, Embedding Models, CV, Classification)\n- Leveraging tools like Triton for efficient distributed inference\n# Self-Hosting AI\n\n- Strategies and considerations for self-hosting AI models\n- Case studies of organizations managing their own GPU clusters for AI inference\n# AI on Edge Devices\n\n- Serving AI to unknown devices: Bringing AI to local devices\n- Lessons from Federated Learning for distributed model training and inference\n# 3. Quality & Reliability\n\n# Testing\n\n- Building a Test-Driven ML Development Workflow\n- Implementing Data Validation: From Schema to Semantics\n- Designing Model Test Suites: Beyond Accuracy Metrics\n- Performance Testing ML Systems: Load, Stress, and Scale\n- Integration Testing for ML: Combining Code, Data, and Models\n# Monitoring & Observability\n\n- Building Real-Time Data Drift Detection Systems\n- Implementing Production Model Quality Monitors\n- Designing ML-Specific Logging Systems\n- Distributed Tracing for ML Systems: End-to-End Visibility\n- Monitoring Complex ML Pipelines: From Data to Prediction\n# Incident Recovery\n\n- Building Alert Systems for ML Applications\n- Debugging ML Systems: From Model to Infrastructure\n- Designing Recovery Procedures for ML Services\n- Creating ML Incident Playbooks: Lessons from Production\n# 4. Automation & Scale: Building the Plumbing\n\n# CI/CD for ML\n\n- Building CI Pipelines for ML: Beyond Standard Software Testing\n- Implementing Continuous Training: From Data to Deployment\n- Automating Model Evaluation in CI/CD Pipelines\n- Creating Deployment Pipelines for ML Services\n- Building Self-Healing ML Systems: Automated Recovery and Rollback\n# Scale Management\n\n- Scaling Model Training: From Single GPU to Cluster\n- Building Distributed Inference Systems: Architecture and Implementation\n- Optimizing Resource Usage in Large-Scale ML Systems\n- Managing Multi-Model ML Services: Infrastructure and Orchestration\n- Optimizing ML Infrastructure Costs: A Practical Guide\n# Container Orchestration\n\n- Orchestrating containers for training and inference\n- Managing GPU Resources in a Multi-Team Environment\n- Building Elastic ML Training Infrastructure\n# Security & Governance\n\n- Implementing robust access control mechanisms\n- Establishing model governance frameworks\n- Abuse Prevention (e.g., user request rate limiting)\n- Ensuring compliance with data protection regulations\nThis structured overview provides a comprehensive look at the key aspects of ML model development, deployment, and serving, covering everything from initial data preparation to large-scale production systems. Each section addresses critical components of the ML lifecycle, emphasizing best practices, tools, and strategies for building robust, scalable, and reliable ML systems.\n</child_page>\n\n\n---\n\n# Community\n\n[https://nexocode.com/blog/posts/lambda-vs-kappa-architecture/](https://nexocode.com/blog/posts/lambda-vs-kappa-architecture/)\n[https://neptune.ai/blog/mlops-tools-platforms-landscape](https://neptune.ai/blog/mlops-tools-platforms-landscape)\n[https://www.youtube.com/watch?v=gxw1gMYP0WM&t=1171s](https://www.youtube.com/watch?v=gxw1gMYP0WM&t=1171s)\n[From MLOps to ML Systems with Feature/Training/Inference Pipelines](https://www.hopsworks.ai/post/mlops-to-ml-systems-with-fti-pipelines)\n[Building an End-to-End MLOps Pipeline with Open-Source Tools](https://medium.com/infer-qwak/building-an-end-to-end-mlops-pipeline-with-open-source-tools-d8bacbf4184f)\n[CI/CD for Machine Learning in 2024: Best Practices to Build, Train, and Deploy](https://medium.com/infer-qwak/ci-cd-for-machine-learning-in-2024-best-practices-to-build-test-and-deploy-c4ad869824d2)\nThe FTI Pipeline Architecture & Feature Store series:\n\t- [Modularity and Composability for AI Systems with AI Pipelines and Shared Storage](https://www.hopsworks.ai/post/modularity-and-composability-for-ai-systems-with-ai-pipelines-and-shared-storage)\n\t- [A Taxonomy for Data Transformations in AI Systems](https://www.hopsworks.ai/post/a-taxonomy-for-data-transformations-in-ai-systems)\n\n[https://cloud.google.com/architecture/mlops-continuous-delivery-and-automation-pipelines-in-machine-learning](https://cloud.google.com/architecture/mlops-continuous-delivery-and-automation-pipelines-in-machine-learning)\n# Papers\n\n\t- [Practitioners guide to MLOps: A framework for continuous delivery and automation of machine learning.](https://services.google.com/fh/files/misc/practitioners_guide_to_mlops_whitepaper.pdf)\n\t- [The Hopsworks Feature Store for Machine Learning](https://dl.acm.org/doi/10.1145/3626246.3653389)\n\n# Blogs\n\n\t- [https://www.hopsworks.ai/blog](https://www.hopsworks.ai/blog)\n\t- [https://www.qwak.com/blog](https://www.qwak.com/blog)\n\t- [https://www.featurestore.org/](https://www.featurestore.org/)\n\n# Courses\n\n\t- [https://github.com/DataTalksClub/mlops-zoomcamp](https://github.com/DataTalksClub/mlops-zoomcamp)\n\t- [https://github.com/GokuMohandas/Made-With-ML](https://github.com/GokuMohandas/Made-With-ML)",
    "content_quality_score": null,
    "summary": null,
    "child_urls": [
        "https://nicolay-gerold.notion.site/Season-3-MLOps-How-AI-Is-Built-2be82e4d93604c0594d84475f0a77721/",
        "https://nexocode.com/blog/posts/lambda-vs-kappa-architecture/",
        "https://github.com/GokuMohandas/Made-With-ML/",
        "https://medium.com/infer-qwak/building-an-end-to-end-mlops-pipeline-with-open-source-tools-d8bacbf4184f/",
        "https://neptune.ai/blog/ml-pipeline-architecture-design-patterns/",
        "https://www.hopsworks.ai/post/mlops-to-ml-systems-with-fti-pipelines/",
        "https://dl.acm.org/doi/10.1145/3626246.3653389/",
        "https://www.hopsworks.ai/blog/",
        "https://medium.com/infer-qwak/ci-cd-for-machine-learning-in-2024-best-practices-to-build-test-and-deploy-c4ad869824d2/",
        "https://www.featurestore.org/",
        "https://github.com/DataTalksClub/mlops-zoomcamp/",
        "https://www.qwak.com/blog/",
        "https://neptune.ai/blog/mlops-tools-platforms-landscape/",
        "https://cloud.google.com/architecture/mlops-continuous-delivery-and-automation-pipelines-in-machine-learning/",
        "https://www.hopsworks.ai/post/a-taxonomy-for-data-transformations-in-ai-systems/",
        "https://www.hopsworks.ai/post/modularity-and-composability-for-ai-systems-with-ai-pipelines-and-shared-storage/",
        "https://www.youtube.com/watch?v=gxw1gMYP0WM&t=1171s/",
        "https://services.google.com/fh/files/misc/practitioners_guide_to_mlops_whitepaper.pdf/"
    ]
}